{"business_id":"ujmEBvifdJM6h6RLv4wQIg","cool":0,"date":"2013-05-07 04:34:36","funny":1,"review_id":"Q1sbwvVQXV2734tPgoKj4Q","stars":1.0,"text":"Total bill for this horrible service? Over $8Gs. These crooks actually had the nerve to charge us $69 for 3 pills. I checked online the pills can be had for 19 cents EACH! Avoid Hospital ERs at all costs.","useful":6,"user_id":"hG7b0MtEbXx5QzbzE6C_VA"}
{"business_id":"NZnhc2sEQy3RmzKTZnqtwQ","cool":0,"date":"2017-01-14 21:30:33","funny":0,"review_id":"GJXCdrto3ASJOqKeVWPi6Q","stars":5.0,"text":"I *adore* Travis at the Hard Rock's new Kelly Cardenas Salon!  I'm always a fan of a great blowout and no stranger to the chains that offer this service; however, Travis has taken the flawless blowout to a whole new level!  \n\nTravis's greets you with his perfectly green swoosh in his otherwise perfectly styled black hair and a Vegas-worthy rockstar outfit.  Next comes the most relaxing and incredible shampoo -- where you get a full head message that could cure even the very worst migraine in minutes --- and the scented shampoo room.  Travis has freakishly strong fingers (in a good way) and use the perfect amount of pressure.  That was superb!  Then starts the glorious blowout... where not one, not two, but THREE people were involved in doing the best round-brush action my hair has ever seen.  The team of stylists clearly gets along extremely well, as it's evident from the way they talk to and help one another that it's really genuine and not some corporate requirement.  It was so much fun to be there! \n\nNext Travis started with the flat iron.  The way he flipped his wrist to get volume all around without over-doing it and making me look like a Texas pagent girl was admirable.  It's also worth noting that he didn't fry my hair -- something that I've had happen before with less skilled stylists.  At the end of the blowout & style my hair was perfectly bouncey and looked terrific.  The only thing better?  That this awesome blowout lasted for days! \n\nTravis, I will see you every single time I'm out in Vegas.  You make me feel beauuuutiful!","useful":0,"user_id":"yXQM5uF2jS6es16SJzNHfg"}
{"business_id":"WTqjgwHlXbSFevF32_DJVw","cool":0,"date":"2016-11-09 20:09:03","funny":0,"review_id":"2TzJjDVDEuAW6MR5Vuc1ug","stars":5.0,"text":"I have to say that this office really has it together, they are so organized and friendly!  Dr. J. Phillipp is a great dentist, very friendly and professional.  The dental assistants that helped in my procedure were amazing, Jewel and Bailey helped me to feel comfortable!  I don't have dental insurance, but they have this insurance through their office you can purchase for $80 something a year and this gave me 25% off all of my dental work, plus they helped me get signed up for care credit which I knew nothing about before this visit!  I highly recommend this office for the nice synergy the whole office has!","useful":3,"user_id":"n6-Gk65cPZL6Uz8qRm3NYw"}
{"business_id":"ikCg8xy5JIg_NGPx-MSIDA","cool":0,"date":"2018-01-09 20:56:38","funny":0,"review_id":"yi0R0Ugj_xUx_Nek0-_Qig","stars":5.0,"text":"Went in for a lunch. Steak sandwich was delicious, and the Caesar salad had an absolutely delicious dressing, with a perfect amount of dressing, and distributed perfectly across each leaf. I know I'm going on about the salad ... But it was perfect.\n\nDrink prices were pretty good.\n\nThe Server, Dawn, was friendly and accommodating. Very happy with her.\n\nIn summation, a great pub experience. Would go again!","useful":0,"user_id":"dacAIZ6fTM6mqwW5uxkskg"}
{"business_id":"b1b1eb3uo-w561D0ZfCEiQ","cool":0,"date":"2018-01-30 23:07:38","funny":0,"review_id":"11a8sVPMUFtaC7_ABRkmtw","stars":1.0,"text":"Today was my second out of three sessions I had paid for. Although my first session went well, I could tell Meredith had a particular enjoyment for her male clients over her female. However, I returned because she did my teeth fine and I was pleased with the results. When I went in today, I was in the whitening room with three other gentlemen. My appointment started out well, although, being a person who is in the service industry, I always attend to my female clientele first when a couple arrives. Unbothered by those signs, I waited my turn. She checked on me once after my original 30 minute timer to ask if I was ok. She attended my boyfriend on numerous occasions, as well as the other men, and would exit the room without even asking me or looking to see if I had any irritation. Half way through, another woman had showed up who she was explaining the deals to in the lobby. While she admits timers must be reset half way through the process, she reset my boyfriends, left, rest the gentleman furthest away from me who had time to come in, redeem his deal, get set, and gave his timer done, before me, then left, and at this point my time was at 10 minutes. So, she should have reset it 5 minutes ago, according to her. While I sat there patiently this whole time with major pain in my gums, i watched the time until the lamp shut off. Not only had she reset two others, explained deals to other guest, but she never once checked on my time. When my light turned off, I released the stance of my mouth to a more relaxed state, assuming I was only getting a thirty minute session instead of the usual 45, because she had yet to come in. At this point, the teeth formula was not only burning the gum she neglected for 25 minutes now, but it began to burn my lips. I began squealing and slapping my chair trying to get her attention from the other room in a panic. I was in so much pain, that by the time she entered the room I was already out of my chair. She finally then acknowledged me, and asked if she could put vitamin E on my gum burn (pictured below). At this point, she has treated two other gums burns, while neglecting me, and I was so irritated that I had to suffer, all I wanted was to leave. While I waited for my boyfriend, she kept harassing me about the issue. Saying, \"well burns come with teeth whitening.\" While I totally agree, and under justifiable circumstances would not be as irritate, it could have easily been avoid if she had checked on me even a second time, so I could let her know. Not only did she never check on my physical health, she couldn't even take two seconds to reset the timer, which she even admitted to me. Her accuse was that she was coming in to do it, but I had the light off for a solid two minutes before I couldn't stand the pain. She admitted it should be reset every 15 minutes, which means for 25 minutes she did not bother to help me at all. Her guest in the lobby then proceeded to attack me as well, simply because I wanted to leave after the way I was treated. I also expected a refund for not getting a complete session today, due to the neglect, and the fact I won't be returning for my last, she had failed to do that. She was even screaming from the door, and continued to until my boyfriend and I were down the steps. I have never in my life been more appalled by a grown woman's behavior, who claims to be in the business for \"10 years.\" Admit your wrongs, but don't make your guest feel unwelcome because you can't do you job properly.","useful":7,"user_id":"ssoyf2_x0EQMed6fgHeMyQ"}
{"business_id":"eU_713ec6fTGNO4BegRaww","cool":0,"date":"2013-01-20 13:25:59","funny":0,"review_id":"fdiNeiN_hoCxCMy2wTRW9g","stars":4.0,"text":"I'll be the first to admit that I was not excited about going to La Tavolta. Being a food snob, when a group of friends suggested we go for dinner I looked online at the menu and to me there was nothing special and it seemed overpriced.  Im also not big on ordering pasta when I go out. Alas, I was outnumbered. Thank goodness! I ordered the sea bass special. It was to die for. Cooked perfectly, seasoned perfectly, perfect portion. I can not say enough good things about this dish. When the server asked how it was he seemed very proud of the dish and said, \" doesn't she (the chef) do an incredible job?\" She does. \n\nMy hubby got the crab tortellini and also loved his. I heard \"mmmm this is so good\" from all around the table. Our waiter was super nice and even gave us free desserts because we were some of the last people in the restaurant. Service was very slow and the place was PACKED but we had our jugs of wine and a large group with good conversation so it didn't seem to bother anyone.\n\nSo-\n\nDo order the calamari and fried zucchini appetizers. Leave out the mussels. \n\nIf they have the sea bass special, I highly recommend it. The chicken parm and crab tortellini were also very good and very big. The chicken Romano was a bit bland. The house salads were teeny. \n\nDo make a reservation but still expect to wait for your food. Go with a large group of people and plan for it to be loud. Don't go with a date unless you're fighting and don't feel like hearing anything they have to say.  Ask to sit in the side room if it's available.","useful":0,"user_id":"w31MKYsNFMrjhWxxAb5wIw"}
{"business_id":"3fw2X5bZYeW9xCz_zGhOHg","cool":5,"date":"2016-05-07 01:21:02","funny":4,"review_id":"G7XHMxG0bx9oBJNECG4IFg","stars":3.0,"text":"Tracy dessert had a big name in Hong Kong and the one in First Markham place has been here for many years now! \n\nCame in for some Chinese dessert, and I must say their selection has increased tremendously over the years. I might as well add that the price has also increased tremendously as well. The waitress gave us tea, which I could taste had red date in it. Fancy!\n\nA simple taro with coconut with tapioca pearls was like $5.25 or something. Basically all the desserts were more than $5. That's crazy! I can literally just make this dessert at home and for a bowl, it would probably cost like $0.50. A few years ago, I think I can still get it for like $3-$4, which is more reasonable, but wow, more than $5 is a little over the top for this dessert. Though I must say, it is Tracy Dessert, and they are a little more on the expensive side. \n\nI also saw other items on the menu like fish balls, chicken wings, shaved ice. My friend got a mango drink with fresh mango in it! \n\nI'm also surprised how many people come to Tracy Dessert after work. We came on a Sunday and the tables were always filled. I think the amount of tables they had were just perfect because no one really waited for seats for a long time, but the tables kept filling up once a table was finished.","useful":5,"user_id":"jlu4CztcSxrKx56ba1a5AQ"}
{"business_id":"zvO-PJCpNk4fgAVUnExYAA","cool":1,"date":"2010-10-05 19:12:35","funny":1,"review_id":"8e9HxxLjjqc9ez5ezzN7iQ","stars":1.0,"text":"This place has gone down hill.  Clearly they have cut back on staff and food quality\n\nMany of the reviews were written before the menu changed.  I've been going for years and the food quality has gone down hill.\n\nThe service is slow & my salad, which was $15, was as bad as it gets.\n\nIt's just not worth spending the money on this place when there are so many other options.","useful":3,"user_id":"d6xvYpyzcfbF_AZ8vMB7QA"}
{"business_id":"b2jN2mm9Wf3RcrZCgfo1cg","cool":0,"date":"2015-01-18 14:04:18","funny":0,"review_id":"qrffudO73zsslZbe8B9D3Q","stars":2.0,"text":"I was really looking forward to visiting after having some of their beers. The \"Man O'War\" quickly became my favorite DIPA; the Rusulka Vanilla Stout is a good thick, sweet stout; and the Ironclad is a top notch IPA. \nThe only big miss on their beers I've had is the Big Chuck Barleywine. It could probably benefit greatly with age, but at this age all there is to taste is the alcohol.  \nNonetheless, I had enough to convince me that the other beers I hadn't had from them would be top notch... and they are! \nThe reason for the 2 stars should not reflect the quality of the brewers, they obviously know their craft well! \nThe servers are great and friendly.... but relying on two servers to wait on 100+ customers says a lot about how inexperienced management must be. In fact, after waiting 15 mins at a dirty table I was finally able to track down someone I guessed was an employee to let them know we were even there! \nAfter another 5+ mins, the GM finally stopped over to take our drink order. The smugness of this guy was amazing. The thought of offering a simple apology never seemed to enter into his head. \nThis is the time a server finally stopped by to pick up the non-final check left by the party before us... who didn't seem very pleased when leaving. \nThe toast & cheese was good, but by the time we were able to dig into their heartiest offering of food, saltines and butter may have been equally pleasing.","useful":1,"user_id":"sG_h0dIzTKWa3Q6fmb4u-g"}
{"business_id":"oxwGyA17NL6c5t1Etg5WgQ","cool":1,"date":"2012-02-29 21:52:43","funny":0,"review_id":"RS_GTIT6836bCaPy637kNQ","stars":3.0,"text":"It's a giant Best Buy with 66 registers.  I don't get it.  What's the big deal about this place??","useful":1,"user_id":"nMeCE5-xsdleyxYuNZ_7rA"}
{"business_id":"8mIrX_LrOnAqWsB5JrOojQ","cool":0,"date":"2011-11-30 02:11:15","funny":0,"review_id":"kbtscdyz6lvrtGjD1quQTg","stars":4.0,"text":"Like walking back in time, every Saturday morning my sister and I was in a bowling league and after we were done, we'd spend a few quarters playing the pin ball machines until our mother came to pick us up.\n\nMy sister was daring and play the machines hard, she was afraid of that \"tilt\" showing up and freezing the game.  I, on the other hand was a bit more gentler and wanted to make sure I got my quarter's worth.\n\nThis place has rows and rows of machines, some are really old and some are more of a mid 80's theme.  There is even a Ms pac man!  It was fun to spend an afternoon playing the machines and remembering all the fun of my early teen years.","useful":0,"user_id":"FIk4lQQu1eTe2EpzQ4xhBA"}
{"business_id":"mRUVMJkUGxrByzMQ2MuOpA","cool":0,"date":"2017-12-15 23:27:08","funny":1,"review_id":"-I5umRTkhw15RqpKMl_o1Q","stars":1.0,"text":"Walked in around 4 on a Friday afternoon, we sat at a table just off the bar and walked out after 5 min or so. Don't even think they realized we walked in. However everyone at the bar noticed we walked in!!! Service was non existent at best. Not a good way for a new business to start out. Oh well, the location they are at has been about 5 different things over the past several years, so they will just be added to the list. SMDH!!!","useful":0,"user_id":"-mA3-1mN4JIEkqOtdbNXCQ"}
{"business_id":"FxLfqxdYPA6Z85PFKaqLrg","cool":0,"date":"2016-05-07 01:36:53","funny":0,"review_id":"Z7wgXp98wYB57QdRY3HQ3w","stars":4.0,"text":"Wow. So surprised at the one and two star reviews!  We started with the most tender calamari. Although the marinara sauce was a bit bland, but a touch of salt made it just right. My husband had the veal with peppers and said it was so delicious and tender. The mashed potatoes were perfect. I had the salmon Diablo which was also delicious. Our salad was beautiful! Dressing was served on the salad and it was a nice amount. We ended our delicious meal with a piece of tiramisu. Our server Matt was right on!! Very pleasant and knowledgeable about the menu. Our appetizer, salad and entrees were timed perfectly. I love salad and did not mind that my entree was served while I was still eating it! No problem it let my dinner cool to just the right temp for me to eat it comfortably. \nI wonder sometimes if people just don't appreciate relaxing and taking time to eat a wonderful and beautifully prepared meal.  A wonderful atmosphere. So relaxing. The chairs are super comfortable too!!! We will certainly be back. \nGive it a try.  Don't  always go by the reviews. \nA bottle of Riesling, calamari app, two delicious entrees and dessert for $92! \nWell with it.","useful":0,"user_id":"GYNnVehQeXjty0xH7-6Fhw"}
{"business_id":"LUN6swQYa4xJKaM_UEUOEw","cool":0,"date":"2018-04-27 20:25:26","funny":0,"review_id":"qlXw1JQ0UodW7qrmVgwCXw","stars":4.0,"text":"Michael from Red Carpet VIP is amazing ! I reached out because I needed help planning my soon to be sister in law's bachelorette. It was a group of 10 girls so I was a little overwhelmed but Michael saved the day! Everything was super smooth and easy! We got good deals and had the best time ever! We booked hotel and a bachelorette package for a great price. I have saved contact info because I will for sure reach out again on next Vegas trip!!!","useful":0,"user_id":"bAhqAPoWaZYcyYi7bs024Q"}
{"business_id":"AakkkTuGZA2KBodKi2_u8A","cool":0,"date":"2012-07-16 00:37:14","funny":1,"review_id":"JVcjMhlavKKn3UIt9p9OXA","stars":1.0,"text":"I cannot believe how things have changed in 3 years. I picked up duck congee sometime in the winter when my hubby was sick.  I was very disappointed because the ginger fish sauce tasted like it had gone bad (it should never be bitter).  Today, my hubby wanted to eat there since he was craving the duck congee and most places don't serve the duck & coleslaw side. We waited about 10 minutes to get our menu.  After we placed our orders, we waited another 5 minutes to get the tea that most places bring with the menu.  I could go on with the details but the gist of the story is they were understaffed or the staff was slow.  The worst part of it was that the service.  The servers make us feel bad for asking for anything (like when they took our order).  We had arrived and placed our order before another couple bside us at least 10 minutes ahead but somehow, this couple received their pho before mine.  They were almost done eating their pho before mine came out.","useful":1,"user_id":"TpyOT5E16YASd7EWjLQlrw"}
{"business_id":"YvrylyuWgbP90RgMqZQVnQ","cool":0,"date":"2017-04-07 21:27:49","funny":0,"review_id":"svK3nBU7Rk8VfGorlrN52A","stars":5.0,"text":"You can't really find anything wrong with this place, the pastas and pizzas are both amazing and high quality, the price is very reasonable, the owner and the staff are very friendly, if you're in downtown check this place out, a lot of people think just because it's downtown there are lots of options around but that's not always the case as there is also a lot of poor quality food in downtown as well.","useful":0,"user_id":"NJlxGtouq06hhC7sS2ECYw"}
{"business_id":"NyLYY8q1-H3hfsTwuwLPCg","cool":0,"date":"2015-01-03 22:47:34","funny":0,"review_id":"1wVA2-vQIuW_ClmXkDxqMQ","stars":4.0,"text":"Great lunch today. Staff was very helpful in assisting with selections and knowledgeable on the ingredients. We enjoyed the BBQ chicken with tika masala sauce and really good naan bread. The biryani with chicken was also yummy! Fun to see the food being prepared in the tandoori ovens. Great addition to the fast casual scene in Cleveland.","useful":0,"user_id":"86J5DwcFk4f4In1Vxe2TvA"}
{"business_id":"cHdJXLlKNWixBXpDwEGb_A","cool":1,"date":"2015-04-01 16:30:00","funny":7,"review_id":"6BnQwlxRn7ZuWdzninM9sQ","stars":3.0,"text":"I love chinese food and I love mexican food. What can go wrong? A couple of things. First things first, this place is more of a \"rice bowl\" kind of place. I thought it was going to be more diverse as far as the menu goes, but its mainly rice bowls you get with different kinds of meats. The ordering was a little confusing at first, but one of the employees helped us out and I got the 2-item bowl and got the jade chicken and hengrenade chicken with all rice(jerk). I also ordered a jade chicken quesadilla on the side.\n\nI'm gonna admit, this place looks kinda dirty. I don't think Arizona uses those health department letter grade system like California does, but if I were to just judge by how it looked inside, i'd give it a \"C\" grade lol. We waited for about 15 minutes or so and finally got our food. We took it to go and ate at our hotel room. \n\nMmmm... the food was just alright. The jade chicken was nothing special. It tasted like any generic chinese fast food orange chicken/sesame chicken variant. The hengrenade chicken, although was the less spicier version of the jerk chicken, was still pretty spicy for me. Just be warned the jerk chicken is super spicy. If you aren't sure, ask for a sample at the restaurant before ordering, but it was way too spicy for me. \n\nThe jade chicken quesadilla was decent, but nothing special. Just imagine orange chicken in between a tortilla and cheese. A friend of mine ordered a jade chicken burrito and we were confused when we pulled it out of the bag because it was literally the size of Mcdonald's apple pie. If you order the burrito, be warned that it's a burrito for gnomes and smurfs, but he said it was tasty. \n\nThey provide a snicker doodle sugar cookie for each meal and it was decent, again nothing special. \n\nNot gonna lie, the next day my stomach felt like a little mexican dude and chinese dude were wrestling and throwing molotov cocktails inside. I used the bathroom like 5 times. I don't recommend eating this place if you have a lot to do the next day.","useful":1,"user_id":"JSrP-dUmLlwZiI7Dp3PQ2A"}
{"business_id":"6lj2BJ4tJeu7db5asGHQ4w","cool":0,"date":"2017-05-26 01:23:19","funny":0,"review_id":"rEITo90tpyKmEfNDp3Ou3A","stars":5.0,"text":"We've been a huge Slim's fan since they opened one up in Texas about two years ago when we used to live there. This place never disappoints. They even have great salads and grilled chicken. Plus they have fresh brewed sweet tea, it's the best!","useful":0,"user_id":"6Fz_nus_OG4gar721OKgZA"}
{"business_id":"y-Iw6dZflNix4BdwIyTNGA","cool":0,"date":"2014-06-27 21:19:23","funny":0,"review_id":"4bUyL7lzoWzDZaJETAKREg","stars":3.0,"text":"Good selection of classes of beers and mains. I've been here twice.\n\nFirst time I had the fried chicken. It was delicious, but be warned, extremely salty. I couldn't even finish the last piece of chicken after experiencing a salt overload.\n\nSecond time we came on a wednesday. We didn't know it was BBQ night, where they have a completely different menu, and don't offer anything from their original vegetarian-friendly menu. This menu has one vegetarian-friendly option - an eggplant sandwich. The vegetarian in my party said it was awful. Also, on BBQ night you choose 2 sides. Except they were out of all their sides except 2 - fries and potato salad. I can't say I was thrilled to have carb heavy sides with my carb heavy main. How do you run out of sides so early in the evening?\n\nService not so great.\n\nI'd avoid coming here on wednesdays.","useful":0,"user_id":"_N7Ndn29bpll_961oPeEfw"}
{"business_id":"qx6WhZ42eDKmBchZDax4dQ","cool":0,"date":"2017-03-27 01:14:37","funny":0,"review_id":"Amo5gZBvCuPc_tZNpHwtsA","stars":5.0,"text":"Our family LOVES the food here. Quick, friendly, delicious, and a great restaurant to take kids to. 5 stars!","useful":1,"user_id":"DzZ7piLBF-WsJxqosfJgtA"}
{"business_id":"Mem13A3C202RzT53npn4NA","cool":9,"date":"2017-05-13 10:41:43","funny":6,"review_id":"IPw8yWiyqnfBzzWmypUHgg","stars":5.0,"text":"If you are looking for the best pierogies in Pittsburgh, this is your place. There are a few small tables outside but most of the business is carry out. Pierogies Plus wins Best Pierogies every year. Why? Because the owner is from Poland and she is making the real deal pierogies. The best part is that they are hand pinched by a group of older Polish and Hungarian women. \nThe biggest seller is potato and cheese but they sell many flavors. They are like plump pillows of softness. You can buy them buy the dozen. You can get them cold to take home and freeze or warm and ready to eat. The warm ones are served with butter and onions.  It's definitely a comfort food. The best part is that they ship internationally. Yes, they are that good.","useful":9,"user_id":"5JVY32_bmTBfIGpCCsnAfw"}
{"business_id":"I4Nr-MVc26qWr08-S3Q1ow","cool":0,"date":"2016-01-17 05:26:22","funny":0,"review_id":"IByf6mVY0WA838XNSh-5MA","stars":4.0,"text":"The food is always good and the prices are reasonable.  Although it's not exactly a restaurant -- more like a snack bar, limited menu and you walk up to the counter, place your order, wait a minute or so for them to prepare your order, and pay the cashier, then search for a table.  Kind of like a sandwich shop.  Still a much better choice for value than the other hotel Deli's on the strip.","useful":0,"user_id":"3CJUJILq7CLHk_9OrvpvQg"}
{"business_id":"d_L-rfS1vT3JMzgCUGtiow","cool":0,"date":"2016-07-25 03:57:19","funny":0,"review_id":"S337tATeouQJdoPYyir29w","stars":5.0,"text":"Pick any meat on the planet and the chef will make a Mexican style dish with amazing flavor! Wow, fish and lamb tacos to die for. Drinks are great as well.","useful":0,"user_id":"2mxBNBeFrgDszqGS5tdEHA"}
{"business_id":"Sfc8Haz2Yri8Mo1L0E0TsA","cool":0,"date":"2012-11-06 03:41:43","funny":0,"review_id":"D_UvaenM25iNd6aehTZ0MA","stars":5.0,"text":"Great food, great service. Obviously fried chicken isn't the healthiest food on earth, but once a month I get that craving for good fried chicken. Their chicken is great, doesn't seem too fatty, and their sides are excellent too. A+","useful":0,"user_id":"8NwU4TRsD3S6gIfBqFzDMQ"}
{"business_id":"FQ1wBQb3aNeRMThSQEV0Qg","cool":0,"date":"2013-12-07 02:32:45","funny":0,"review_id":"I9HBDyzCqLhTYHCAZIFZQQ","stars":5.0,"text":"PlumbSmart provided superior service from beginning to end.  They were able to repair a badly damaged sewer pipe with only one day's notice.  I was particularly pleased with their attention to care when cleaning up the landscape after the job was completed.  Their competitive pricing and excellent service make them my first stop for all future plumbing needs.  Thank you to Wayne and the whole team!\n\n-Scott B","useful":4,"user_id":"vXZeHaLvdfCPATz5BDavow"}
{"business_id":"hd5xm20tfSa70-6UqD9-bg","cool":1,"date":"2014-08-10 22:07:35","funny":1,"review_id":"W1wbNaUnbMy4b9QqY3_SAg","stars":1.0,"text":"Unfortunately, I must recommend not to conduct any business with Fast Fix Jewelry and Watch Repairs.  The staff is completely unprofessional and I have never been treated so rudely in my life.  I was actually shocked and walked away thinking \"wow, how do those people even have a job?\"\n\nI have never written a negative review before, I usually chalk it up to someone having a bad day.  I have worked in customer service for 10+ years and I know it is exhausting and bad days happen.  But this is a special occasion.\n\nI drove 30 minutes to try to find someone who could help me repair a watch band.  I was barely greeted upon arrival and right away felt like I was bothering them.  The girl behind the counter obviously just wanted me to leave, the blond kid working snapped at me when I asked a question and when I re-asked in order to clarify what he said he snapped again and said, \"I already told you?!?\"  \"Is this even authentic?\"  Shouting at me over his shoulder as he work on something else. \n\nI was shocked and just stood there put my watch away awkwardly and left with no one else saying a word to me.  There are a lot of places that fix Jewelry in this city and I will be taking my business elsewhere and recommend that people reading this review do the same.  Some places, just do not deserve a loyal customer base.","useful":7,"user_id":"vDr8hBNYigiY70fk1kF5iQ"}
{"business_id":"Gyrez6K8f1AyR7dzW9fvAw","cool":1,"date":"2013-12-28 22:28:08","funny":0,"review_id":"qm97yMwREr7BKkexlwLFbg","stars":5.0,"text":"their pettuccine was fresh-made in the morning. it was very delicate and yummy! the owner and staffs are super kind and delightful. We also had Veal piccata. it was classic! love this restaurant.","useful":0,"user_id":"TTRVdTXKcq-xn6-1IWbwEw"}
{"business_id":"9nTF596jDvBBia2EXXiOOg","cool":0,"date":"2014-04-19 15:03:17","funny":0,"review_id":"1daGBpea0sleayFeeXuoYw","stars":1.0,"text":"if i can give this place no stars i would, i only had their hot pot though, so im not a good judge for anything besides their shabu. i must say, quantity was small, price is expensive for the quality and quantity, and the taste of the soup base is bland as if they just put hot water in. the sauce selection is limited and not very fresh/clean from my perspective. i love hot pot and i would never go back again because home made hot pot can be much better than this place without even trying. anyways, if you have a good appetite for hot pot, you can do yourself a favor and skip this place because it can make you miserable!","useful":1,"user_id":"q3GeSW9dWN9r_ocqFkhrvg"}
{"business_id":"SNL64axQhCO6Z7ohcWg3wA","cool":0,"date":"2017-02-09 03:43:25","funny":0,"review_id":"DAC4zWY2ZMa1vxpN9RrDvA","stars":1.0,"text":"This review is in regards to our experience watching SuperBowl 51 February 5, 2017 at the WestGate in the theater/auditorium.\n\nWatch the game somewhere else.....\n\nTo those unfamiliar with The Big Game experience at WestGate you typically would get in line to watch the Superbowl in the theater portion of the hotel around 8 am on Superbowl Sunday. This line can get extremely long yet the earlier you get in line your choice of seating significantly improves.So...after waiting in line for a few hours we were notified the lower portion of the theater was reserved for paid customers who previously purchased wristbands for $100 (including alcohol and hot dogs) and instead we would be seated in the balcony portion of the theater.No problem, something different, we said. Mistake.\n\nSo at 1:30 pm we were sent upstairs to the balcony to take our seats and prepare to watch the big game at 3:30. Once we take our seats one of us ( we're in a group of 8 ) will hold the seats while the rest of us will go out to the casino floor and gamble or go the the sports book and place a couple last minute bets.Please note the patrons that leave the auditorium will receive a hand stamp or wristband to allow reentry to the theater. BUT INSTEAD....\n\nWe were told by Westgate staff that no hand stamps or wristbands would be given and we were ON OUR OWN if we choose to leave and we would not be allowed back in. Wow.\nThat's right, after waiting in line all morning if we wanted to go downstairs to play blackjack, place a bet at the book, or maybe have a bite to eat because no food was made available upstairs we would be out of luck. Nice work Westgate.\n\nSo we were seated upstairs...stuck. With no food or soda available for purchase. Only beer and water was sold in the balcony food counter. That was at 1:45 p.m. After vigorously complaining to Westgate staff ( to ushers with yellow jackets and security with black jackets ) at 3:04 pm wristbands were given out. At 3:18 hot dogs and soda were made available for sale in the balcony. I believe this was a direct result of all the upset patrons like myself that were seated in the balcony level.\n\nIn summary, for being the biggest sportbook in Las Vegas this place is dysfunction and fails to satisfy the most basic request to provide food and comfort to betting patrons. A total mess. This place sucks. Watch the big game and bet your money some where else. We will.","useful":0,"user_id":"yxyRt-zoh_A6PMThX-h9Vw"}
{"business_id":"dm6sO_Y8JdKTE1ZM955yug","cool":0,"date":"2014-12-17 19:04:33","funny":0,"review_id":"0AsmPiAQduxh5jE_si8cLA","stars":5.0,"text":"ended up here because Raku was closed and it received great ratings on Yelp.  I'm so glad I came here.  One of the better meals I've had.  Started off with the mushroom dish and the lettuce wrap.  both were amazing. the lettuce wrap is like having a flavor party in your mouth.  also had the panang duck which was terrific. highly recommend all three dishes. one dish that wasn't so good was the seabass with drunken noodles. overall it was an excellent meal, intimate setting, and great service. definitely will be back.","useful":0,"user_id":"C_hUvw2z0R-Rv0yZb6QCZA"}
{"business_id":"XTzKRvWciP_BZ9imk8mmPQ","cool":0,"date":"2014-06-27 21:32:31","funny":1,"review_id":"bjD0Dqn3k-fi00BXatrytg","stars":1.0,"text":"I tried this place because my girls are away for a month, and I REALLY wanted to try to wait until they came back, because NOBODY can hold a candle to them, but my toes were desperate.  When I went in, they were almost twice what I usually pay to begin with.  Then, before starting the pedicure, I specifically told them I already had gel polish on my toes.  They didn't tell me right then and there \"that will be an extra $5'.  No, they waited until it was time to pay, and not only charged me for that, but they charged me all kinds of extra fees that I didn't even ask for!  I had also informed the girl that my toenail was loose and needed gluing.  While I was looking at my phone, all of a sudden I felt this sensation, and she RIPPED OFF MY TOENAIL!!!!  Without even asking me!!!!!!  So then she had another girl come and put acrylic on there since the nail underneath was only 1/2 grown.  Again, they didn't tell me how much this would be, or even ask my permission, they just charged me at the end.  \n\nThe added stone 'massage' was barely a massage!  She rubbed the stones up my lower legs a couple times, and that was it.  It lasted about 30 seconds.   And when I asked for a design, I'm used to getting a board with a bunch of designs to choose from.  She didn't even ask me what I wanted, she just painted a few lines on my two toes and then charge me 5 MORE dollars for that! \n\nUgh, I don't care HOW ugly my toes look next time, I will NEVER go anywhere else besides Bella Nails again, they ROCK!!!!!!!  This place was appalling.  I didn't want to make a scene, so I just paid the money, but I will NEVER go back!!!!!!!","useful":5,"user_id":"1fi6x4tnJtlVWaJmoIO9XA"}
{"business_id":"CDpoJiqgM04wqQTZ6QkTqQ","cool":0,"date":"2015-12-05 02:37:03","funny":0,"review_id":"CelUWzp-GnJIiiV1mDUb-g","stars":1.0,"text":"Love this place downtown but the Scottsdale location has no manners. Sat at bar for 10 min while bartender ignored us. No menu, no water. We walked out and they could have cared less.","useful":0,"user_id":"tFICmdLtwgFIRcwtlbYQOg"}
{"business_id":"3JxKzWquEbPC3yPIfoCiLw","cool":0,"date":"2016-03-07 01:03:08","funny":0,"review_id":"hUUfzKeDLo930LA9-v2tWQ","stars":5.0,"text":"Best chinese resto. Highly recommended. 5 stars. Let us support this business. Best in the west valley. Trust me you wont gi wrong coming to this place","useful":0,"user_id":"uFVAAe0JC81IPmxgT49Hcw"}
{"business_id":"YSUcHqlKMPHHJ_cTrqtNrA","cool":0,"date":"2017-12-29 13:55:19","funny":0,"review_id":"E6B-2U2sGG3xgmnNWZAEew","stars":1.0,"text":"Came here on a Thursday night at 6:30 p.m. My friends and I had a reservation, but it was not needed - the place was almost empty.\n\nSERVICE: Extremely Poor\n\nWhile I enjoyed the company of my friends, I would not come back to this restaurant, primarily because of the poor service. Once we were all seated, we were not greeted by anyone for over half an hour, and when someone did come by, we asked whether we could place our orders, to which he said he could not; he's doing something else - so we waited at least another 15 minutes before someone came to finally take our orders. \n\nMAIN: Caprese Salad\n\nThe salad was okay - a bit salty for my liking. I personally did not find this dish filling, so I ordered the sweet potato fries as well (See below).\n\nMAIN: Sweet Potato Fries (this was worth it) \n\nThese fries were actually very delicious - crispy on the outside and soft on the inside. If you visit this restaurant, I would recommend this particular dish, especially given the price ($8) and the portion size (it was quite large - almost the size of a large plate).","useful":0,"user_id":"DbccYu3OppWKl21OanZnTg"}
{"business_id":"N0apJkxIem2E8irTBRKnHw","cool":0,"date":"2015-01-18 15:30:50","funny":0,"review_id":"wOv7JiO0EGcJ61P2JcDS1g","stars":2.0,"text":"Went here last weekend and was pretty disappointed. They did not have one thing that was pictured and recommended on yelp as being good. We started off with the steak grilled skewers which were just Ok, nothing special. My freind got the lasagna and I got some special chicken dish. They were both pretty bland and lacking that kick. Our waitress was really nice and got the manger to switch out our dishes. My freind got the hamburger and I got the shrimp scampi. Her hamburger was better then the lasagna but was still lacking flavor. My scampi was better then the chicken but was also still under seasoned and the noodles were a bit under cooked. With such a big name attached to this restaurant and going on such an empty stomach we had such high hopes. The service was great which is why i gave it three stars.","useful":0,"user_id":"en0xQXlvRk-ZtKlaW4I8eQ"}
{"business_id":"sMzNLdhJZGzYirIWt-fMAg","cool":0,"date":"2015-06-21 00:59:14","funny":0,"review_id":"RLbWoIri29BcQ8yjzsvQLQ","stars":5.0,"text":"This place epitomizes the rumored transformation that is in the process of taking place in Pittsburgh. Great food, drinks, and service, but the atmosphere is second to none. Definitely a must visit for locals and visitors alike! You will not feel like you're in \"Pittsburgh\".","useful":0,"user_id":"_o740mSNRhMNYuPjSJoPLg"}
{"business_id":"IMLrj2klosTFvPRLv56cng","cool":1,"date":"2014-10-11 03:50:27","funny":1,"review_id":"JIC8qNMbcAPAzQMPrtsTJw","stars":4.0,"text":"Dinner Was Fantastic! Service was great We started with the corn soup and the tuna tartare. We shared the Filet and Scallops. Both delicious entrees! We didn't realize the steak came with potatoes and ordered two sides Mac and cheese and shishito peppers. I thought the peppers were really hot but I'm a whimp I guess! We will definitely come back","useful":1,"user_id":"fxrQSMhHlBv6eJVRdchG9Q"}
{"business_id":"5OZlLXjU0FXUbrw8Scja6g","cool":0,"date":"2018-02-01 19:01:16","funny":0,"review_id":"vBRxlgkpDTXjWiYBp1V6GA","stars":1.0,"text":"They keep there appointments on time and are pretty efficient. However I am very disappointed in how they think that just because I am a girl that I do not know what is going on with my car's tires. The guy that helped me out told me that my two front tires tread was extremely low and that I would be needing two new tires in a month or two. He told me that he could show me the same tires I have on there now and how much they would be. When the I had taken my car to the other Discount Tire they told me it that my tread was actually still really good for how many miles I have on my car. When he told me the price of the two tires it was around $280. Which I had just bought two new ones a couple months before that and they were the same price. So when I bought the two new tires my tire pressure light came on not that long after that. I honestly feel like the tires were not even new and did not look worth $280.","useful":0,"user_id":"wNyiw6GfVfn5Kphqmux1gw"}
{"business_id":"m7ommfJFalI47UksyX04Iw","cool":1,"date":"2014-09-25 08:15:44","funny":2,"review_id":"eed44nI0eZ4BGKtKXsRJhQ","stars":1.0,"text":"Met a friend for dinner there tonight. The server only brought us one menu. After she brought us a couple of Cokes she didn't come to our table for 20 mins. After trying to get her attention a few times when she walked by we decided to just order off the bartender. We received the starters and the mains at the same time. The wings, brisket, and mac and cheese were alright at best. At this point we hadn't seen the server since she brought the food, so we had to go to the bar for more napkins and refills on the Cokes. The most we actually saw our server was when she hovered over us as we put the tip into the handheld credit card terminal. \n\nFood was somewhere between okay and decent. Service was somewhere between piss poor and terrible.","useful":6,"user_id":"tAcB1ZohRtjozsymvqqHzQ"}
{"business_id":"m7ommfJFalI47UksyX04Iw","cool":0,"date":"2014-10-27 04:22:34","funny":0,"review_id":"UoFxqWXBluvS4Q32spb8Lg","stars":4.0,"text":"Another solid BBQ place in Calgary. This is definitely a great place to go if you are craving something smokey and delicious. \n\nI actually noticed this place because I wandered by when I was walking downtown and it's impossible to miss that lovely smokey/BBQ smell if you're on the block. However, it looks kind of like a hole in the wall. The entrance doesn't look like it's been updated in years, and that's ok because it just adds character. The entire decor is wood/country (to include buffalo head on the wall) and there is also a downstairs where there is live music on the weekends.\n\nOk onto the food. I have been here a couple of times now, so I think I can comment on the menu pretty well. My friends and I have ordered the brisket, the catfish, the veggie burger, the mac n cheese, the cesar salad, the chili, and the garlic fries. If I had to review this place based on the delicious and garliciness of their fries, this would be a 5-star review hands down. I mean, seriously, vampires beware, but everyone else should enjoy a-plenty.\n\nThe portion sizes are huge, so go hungry or be prepared for a to-go box (granted every time I've gone I have loved the food so much that I ate the entire meal.) \n\nI bet at this point in time you are wondering why I am only giving this place 4 stars then? Well, not everything is as amazing as those garlic fries. The bourbon apples are fairly tasteless, the chili is ok (the meat was very tough), and the service is also just ok. However, the catfish is delightful, the mac and cheese is also delicious, and the brisket is quality. \n\nThe specialty cocktails are also pretty good, and the beer prices are pretty decent. This is a great place to go for a long lunch, after dinner drink, or even a weekend brunch. There are vegetarian options on the menu (if you can ignore the buffalo head on the wall) and I believe even a few gluten-free options as well. It's a fairly good place to go with a large group, just make sure to call ahead. \n\nAll in all, like I said earlier, a great place for good times and smokey flavor.","useful":0,"user_id":"5rWm6uBPeewOiml4pcqp3w"}
{"business_id":"RbrZJEf8TlnP7RHaKnCtIQ","cool":1,"date":"2013-11-14 04:55:17","funny":0,"review_id":"8swMTt9IXycp15r3WlCEmg","stars":3.0,"text":"One day after I satisfy my frozen yogurt craving at Kiwispoon... I get invited out to eat frozen yogurt at Piccadilly.  A rare opportunity to truly compare the two yogurt places.\n\nHere, I tried three flavors - chocolate, pumpkin, and caramel sea salt.  Added toppings of brownie bits, chocolate caramel turtles, and mochi.\n\nOverall, I liked the yogurt better at Kiwispoon. The frozen yogurt seems less rich in Piccadilly's and the flavors are not as strong.  The price per ounce is also marginally higher at Piccadilly's.\n\nThere are definitely pluses to Piccadilly's yogurt though.  I liked the toppings better - I thought the mochi tasted better, the brownie pieces were bigger, and the chocolate caramel turtles went great on ice cream.  The chocolate caramel turtles should be a standard topping for both frozen yogurt and ice cream places.  Also, with the huge map of Cleveland Heights behind the cash register, this feels more like an authentic \"neighborhood\" froyo joint.","useful":2,"user_id":"ITSnuLOu81doC5GGT5NMSQ"}
{"business_id":"wJj1EwYcXHdvA9zKqmb5hQ","cool":0,"date":"2018-10-04 11:20:42","funny":0,"review_id":"NqYSX93Amv4sd5pPPr3Gag","stars":5.0,"text":"I called the number provided and same day they showed up to my residence for an inspection. Was able to advise me of multiple broken and loose tiles on my roof and came out just a few days later and completed the repairs. Quoted me a good price for the repairs as well. No complaints!","useful":0,"user_id":"zFYFuufYWQSPj0r5lrKQKg"}
{"business_id":"jScBTQtdAt-8RshaiBEHgw","cool":1,"date":"2018-05-28 20:56:05","funny":0,"review_id":"j3vP8537KHvoXNHQIr3haA","stars":5.0,"text":"Party of 3 ordered the fish tacos, pork belly banh mi, corn beef hash Benedict, and bam ham. Everything was delicious, esp the pork belly banh mi. It's tender and juicy and the baguette was nicely toasted. Love the crispy fish taco too. Their compliment chips and salsa were fresh and super good and crispy. Service was excellent. Our waitress did a great job checking up on us and serving us. I really want other food options too but I'm too full. Next time i visit i will definitely come back.","useful":1,"user_id":"Z_HE_KKT7N-WddPTzUQC7A"}
{"business_id":"ujHiaprwCQ5ewziu0Vi9rw","cool":0,"date":"2013-12-07 00:14:06","funny":0,"review_id":"f0B9-r14-bLudyu5S7aLhw","stars":1.0,"text":"We had dinner at the Bellagio Buffet last night. The service was OK. Our server was great but kind of forgot about us towards the end of our visit. The food was cold. The only good thing there was the crab legs because they're suppose to be cold and the tacos because it was freshly made. The food was under a single lamp that didn't heat the food at all. We let the server know that the food was cold and he told the manager that was in charge. All she did was come over to ask what the problem was and said she was going to talk to the chief. Have no idea what actually happened though because we didn't see her after that. Half the buffet was closed as well so there wasn't that many options. I must say i rather go to the Rio buffet. For a high end casino this was a horrible experience.","useful":1,"user_id":"SvMGr_Oih7ivtzmnCL-Tmg"}
{"business_id":"6sATfFam9_q9uod0I2aCsg","cool":0,"date":"2014-02-05 18:07:17","funny":0,"review_id":"9cW1B-T6M3ER3_rH_36h9Q","stars":5.0,"text":"I really enjoyed my visit here.\nEverything was visually appealing to me.\nAmbiance was great. Food tasted amazing. Service was . No complaints at all","useful":1,"user_id":"D-vYE3HILl7Qk1UhYqZXYQ"}
{"business_id":"EIL41z-hvVCeYHqfA9PyWQ","cool":1,"date":"2017-09-20 15:23:35","funny":0,"review_id":"vzMkIQm34QWBCYaHdV-2mQ","stars":5.0,"text":"Flat out fantastic!  Have been here twice and the croissants are the bomb. Can't wait until I can try other items. THE new breakfast spot in Ahwahtukee. The service is great as well. Family run business. Come and support them.","useful":1,"user_id":"jAVtSgE5L-Dt6_I5FIiVGA"}
{"business_id":"jzveTy7ogH7cg9axZ78ENg","cool":0,"date":"2015-04-01 13:31:35","funny":0,"review_id":"0NRNA8qIq9nKw5FcwyOxcQ","stars":4.0,"text":"Very nice eating environment and the food are quite nice. Very native Japanese style.","useful":0,"user_id":"54kpqrxF9DEPpwa51hO_Bw"}
{"business_id":"OVTZNSkSfbl3gVB9XQIJfw","cool":0,"date":"2010-01-08 04:28:23","funny":0,"review_id":"u1jQX0KfnG3AHty4ifEpFA","stars":4.0,"text":"notes: 1 visit, breakfast/lunch\noverall: Excellent high-end buffet, but the dessert section needs a little work.\n\nhighlights: \n- Dip the foccacia pizza in some chimichurri sauce, and it's the best pizza you'll have ever had.\n- Prime rib is excellent\n- I hate crab legs in general, but everyone else says they were great here, really fresh.\n- Cookies!  You must try their cookies.  I got so lucky and grabbed some white chocolate macadamia cookies when they were still warm.  Crispy on the sides and chewy and mouth-wateringly good.  I mean, I was stuffed beyond belief, but I couldn't stop eating it!\n- If you get in during breakfast time, do try the Portuguese sausage.  It's the only breakfast food really worth it.\n\nAvoid:\n- Gelato bar looks good, but the texture was more like the soft serve at Dairy Queen. (which I HATE) So disappointed.\n- Shrimp pad thai was served ice cold.  So gross.","useful":0,"user_id":"8vIK6ndl8yzIdmSDnGp0tw"}
{"business_id":"9MbGG8PxrlpBWVm3QyWy_g","cool":0,"date":"2016-09-18 15:19:33","funny":0,"review_id":"xQksr0gAyssKdnP2olE0Ow","stars":1.0,"text":"I am years out from surgery with sacs and I wish I could turn back time.  He promises great things them butchers your body. I should have left my body alone. It was not bAd. I was out to perfect it.  We often talk about how he ruined a good body.  I will never forget his dirty nasty slippers coming into the operating room. I should have run from the room then.","useful":3,"user_id":"vVhE4lGdsGK5rQgBfOGFxA"}
{"business_id":"FBSWwaE6gR7KAOyG1QhakQ","cool":0,"date":"2015-01-03 21:11:31","funny":0,"review_id":"-QxhbVQrcnVWGiua9r44JA","stars":5.0,"text":"Such a unique place & a great find. Our waitress was funny, knowledgable, and did a fantastic job. The food was amazing. We will definitely return and recommend this restaurant to other couples!","useful":0,"user_id":"jsOz-dWToun2VsFcFAfGww"}
{"business_id":"X5uxdU9GHoUAqo2wmbg3OQ","cool":1,"date":"2015-11-06 00:02:50","funny":0,"review_id":"bvEdkl-weZGMLLRF9e0-ew","stars":5.0,"text":"Best Wonton soup ever!!! Delicious food and great service. We had Chicken Satay, Roti C., Wonton soup, and one of the fried noodle and shrimp dishes. Definitely will be back!","useful":0,"user_id":"0nTJWagRU8_-KS1x7Zw5Yw"}
{"business_id":"rBo_suDMdGmFQ0TtYg3b2Q","cool":0,"date":"2014-07-13 16:17:18","funny":0,"review_id":"Saae_VVf_v0fyNmB6Dc4kw","stars":1.0,"text":"I've never experienced discrimination as I did last night at this place. I was with 2 other females...we had on dresses and heels. The place was very diverse as far as how everyone was dressed. Dresses, heels, jeans, flip flops, shorts, etc. Immediately we noticed large groups of people of a particular race coming from the back of the line and going inside. We thought nothing of it...assumed they were all on lists. Then it just got weird. We noticed the guy working the door was walking back and fourth scanning the line for people he would pull out and let go inside. Every time it just happened to be groups with Caucasian people. 4 Caucasian girls were in front of us and behind a group of 4 black males. The girls were pulled out of the line and taken to the door to go inside, no talk of any lists. The guys were told they must be on a list or leave. The guys left. We watched this happen quite a few more times before we just gave up here and removed ourselves from the line. We were standing in the front for a really long time with no acknowledgement from the guy working the door. Funny thing is he didn't make a big announcement that we must be on a list to get inside. He was walking up to particular groups and telling them in a low tone so they would leave. I know it wasn't because of how we were dressed or looked....they were letting people in with jeans and flip flops. Ultimately we were let in by a bouncer at a side door. There was nothing so special going on in there that they had to be \"picky\" about who they let inside. It was like a night at Suite.  Safe to say, I will never step foot in this place again.","useful":4,"user_id":"PttoI2Meg76KVB8JxjC5Xw"}
{"business_id":"eoyvbnRYQe-z85e8Rc6vAg","cool":0,"date":"2013-08-15 15:00:14","funny":0,"review_id":"7Jy730ib54YKYgZRvcBNJg","stars":4.0,"text":"We had dinner here and the food was excellent and the service couldn't have been better!\nThanks Jose! \nWe will be back for sure.","useful":1,"user_id":"ROsjOYL8Jwv-q78mNm69Hg"}
{"business_id":"5FIOXmUE3qMviX9GafGH-Q","cool":0,"date":"2017-10-02 02:28:34","funny":0,"review_id":"SWiEJZUJM6rUDJFwbWB6OA","stars":5.0,"text":"Absolutely love this place! I've been here many times and it never fails to impress me  the bff burger is unreal and the tsoynamis and cupcakes are amazing!! Everything is pretty much the best","useful":0,"user_id":"SAM29wXWmT0-aRMXt0RQzQ"}
{"business_id":"hcFSc0OHgZJybnjQBrL_8Q","cool":1,"date":"2013-05-07 03:29:21","funny":0,"review_id":"vAckaF8n0KKJeqHOnb1ayw","stars":4.0,"text":"Here's why I don't write reviews for Chinese restaurants: I have to look up their English names... \n\nIt's so popular that I didn't try it until recently. The bubble tea here is really good. It's pricier than the one in Rose tea, but you also get more. \nI like that noodles with pork sauce. I've tried both the thin and wide/thick noodles. The wide one is less chewy and are kind of sticky. I prefer the thin one for this dish.\nDan dan noodles are different from what I was expecting. My friend liked it but it's just okay for me.\nThe noodle with wonton is flavorless to me. \nThe soup dumplings are good but not amazing. If you've never had it before, give it a try and you probably will like it.\nI'd like to try noodles with beef soup next time.\n\nThe appetizers are too pricy in my opinion. I won't pay $6 for a small plate of vegetables again...\n\nThe owner is a nice guy and I enjoyed chatting with him a little bit during dinners.","useful":1,"user_id":"JjDR060LJQcNNVWKuU64fA"}
{"business_id":"OVTZNSkSfbl3gVB9XQIJfw","cool":0,"date":"2014-09-09 19:15:26","funny":0,"review_id":"VqZMgUf4wQMTeCWg2M_e8Q","stars":3.0,"text":"We went here Saturday for dinner. We had a 2-1 coupon. Price was $37 for two people so a good deal. \n\nVery large space, open layout.  Been here a few times years ago. I ate mostly the crab legs. Prime rib. \n\nThey provide a self serve drink area, which I think is good.  You don't have to flag down a staff to get a drink when you want one. We've all been in that situation. \n\nUnlimited alcohol, wines and beer. They have a bar area with one bartender working and a bunch of tv's to watch or get updates on games. \n\nI wouldn't go out of my way, but if I was in Mirage and hungry, I'd eat there if we had another 2-1 coupon. I wouldn't spend full retail price eating there. Other buffets on the strip are better for same price points.","useful":0,"user_id":"POr1NTWV45OaNCOLfb47fw"}
{"business_id":"WsdmzI2giWHcRN2plprxIg","cool":4,"date":"2013-05-28 21:06:57","funny":14,"review_id":"UIvFkXLBxWxM6aekvaCp8Q","stars":2.0,"text":"Took my kids here to hang out on one fine 72 degree sunny Saturday in February. Going over the bridge, coming from Aliante Casino, you cant miss the nice view of the waterfall that is at the forefront of the park.\n\nToo bad this and the playground were the only nice things I can vouch for. \n\nThe playground is a nice fenced in little area that has a decent amount of playground equipment, swings, slides, tables, and benches. I like the soft material they use that the playground equipment is built on. There is also a sand lot area that has dinosaur bones as props. The day we went, the playground was packed. Kids were running into each other as they went down the slides. There were kids actually waiting to get on the swings! \n\nAfter a while we decided to walk around to check out the rest of the park. We see ducks everywhere especially in the pond that has the nice waterfall going into it. Unfortunately, this is where the \"nice stuff\" ends. Everywhere on the paths we were walking on were green duck crap. Which brings the question, \"Is there some kind of spray or force field they have on the playground?\" Because there were no ducks or green duck crap anywhere in the playground. Im also curious as to how many people would actually spread out a blanket and have a picnic on the grass for the crap was all over that as well. Just doing this review im starting to get grossed out thinking about that day.\n\nAfter carefully trying not to step on any crap going to the car, I made a mental note to make sure to mention all the green crap I saw in this review and to not hesitate in mentioning it to everybody I know that is either making plans on coming here or are just thinking about it. The only thing positive I can think of about that is to come here if you are on a diet. After seeing all the green crap, you probably wont be having much of an appetite and you definitely will get some exercise trying to avoid stepping on the stuff. \n\nSo, yeah, im not worried about coming back to this place any time soon in this lifetime. (You think?). Lol. Maybe as a duck.","useful":5,"user_id":"0FMte0z-repSVWSJ_BaQTg"}
{"business_id":"MjeeiLhVq3-BBz-A997r0w","cool":0,"date":"2014-01-17 02:08:15","funny":1,"review_id":"4pfD5yB-S2PduTInghEcNg","stars":5.0,"text":"There is a reason I frequent Paul's Ace over the big names such as Home Depot or Lowes: the personalized assistance. Do the big name brands provide this? Yes, bit not at the same level Paul's Ace Hardware does in Tempe. If I need help, they are ready and willing to help me in every aspect of my project.\n\nThe store manager Bras personally went out if his way to assist me in gathering all the materials I needed for my current project. He knows his store, bounced around to show me all options, and seemed to have recommendations on each project. This guy must love what he does because he knows everything in the store (or he is a constant do-it-yourselfer).\n\nI am always pleased with the help I receive and am thankful this place is in my neighborhood.","useful":0,"user_id":"2H2mj0pJtzAqWL2zJ4m3Jw"}
{"business_id":"dZVMp70AuSa4dQPvx3J4ow","cool":1,"date":"2011-09-25 18:10:04","funny":0,"review_id":"IRwIFWgjJiMSBBucewhHDg","stars":3.0,"text":"In need of a burger, this was the closest location from work that wasn't your typical fast food joint.\n\nI always like to chose a signature burger so I opted for the Spicy Cajun Burger and combo'd it up with there Beer Battered Rings and a Jones Strawberry-Lime  Soda.\n\nIts a small location with an even smaller patio ( maybe 8 bar stools on a cramped balcony) that looks onto Charles Street. But definitely sit outside if you can grab a seat. Luckily the patio was vacant that late afternoon.\n\nToppings - They Spicy Cajun Burger - Avocado, jalapeos, lettuce,\nJalapeo havarti, tomatoes, Cajun spice & Smokey chipotle & honey mayo. There was ample toppings on the burger, I enjoyed the avocado on my burger, overall not too spicy but good kick from the sliced jalapeos.\n\nMeat - Grilled perfectly, tasted average, but I found it too small compared to the bun.\n\nBun - Very soft, tasted good, but didn't hold up against the burger and all the toppings and at the end I was left with lots of bun and no more burger.\n\nBeer Battered Onion Rings - Very thick batter on these rings, golden brown, crunchy, very filling.\n\nDrink -Jones Strawberry-Lime Soda - Yummy not sour but good balance,\n\nOverall prompt friendly service, quaint little patio, average burger but good for a quick fix in satisfying the burger craving.","useful":2,"user_id":"PFNZVn73upq3oZDG2KnAqA"}
{"business_id":"oSDyex506Y8H7YegcRb_9g","cool":0,"date":"2016-06-22 21:45:13","funny":0,"review_id":"h2lt2Lu8a9jUtYEbB2krhA","stars":2.0,"text":"Sadly this place has been sold.  The gas prices have sky rocketed, some of the long term staff is gone, lottery is gone, they have run out of popular cigarettes, I tried to get gas a few days ago and the vendors / delivery trucks that used to park on the side street or off to the side were parked at the pumps...I am going to give it a little time and see if it gets better.  I have been going to this store for 15+ years, but if it doesn't shape up, I will find another....","useful":1,"user_id":"0T2qMGDRJJSrhxpy4h3wNg"}
{"business_id":"FBSWwaE6gR7KAOyG1QhakQ","cool":0,"date":"2016-03-07 00:20:06","funny":0,"review_id":"HYBzY7zN_YBHtQu6qkD3Ng","stars":5.0,"text":"Easily entering my top 3 restaurants in Charlotte after just one visit!\n\nPork Belly, unreal! Had an AMAZING prime NY Strip with bourbon butter jam, PHENOMENAL!","useful":0,"user_id":"OnYEKooAtI2zTRqBLLIfvA"}
{"business_id":"SU56w479vUfFHsvmvQIf7A","cool":6,"date":"2016-07-25 03:55:20","funny":5,"review_id":"E4LqIZ7DJd_R4ZHSNKx4RQ","stars":4.0,"text":"So good! They didn't make it to 5 stars due to the prices are a bit high for the amount of food and the location is a bit unsavory. \nThe decor and atmosphere was surprisingly nice, from the outside I expected to be more run down inside. The staff was very nice. We were surprised how empty the dining room was for a Friday evening.\nWe got Vegetable Samosas to start then ordered Chicken Tikka Masala, Lamb Rogan Josh, rice and plain Naan. Our only complaint was the lamb could've been more tender but everything was flavorful and delicious. \nI would definitely go again if given the chance.","useful":7,"user_id":"DoRCeCcJbrsM2BiAKj3trA"}
{"business_id":"dInxwF8kXVdfLEGTIBRrSw","cool":0,"date":"2017-04-30 04:13:18","funny":1,"review_id":"CvJy7CdHJqsZNq22fUF7hA","stars":2.0,"text":"Employees were to busy chatting with each other. One employee had his head out the  drive thru window talking to people the entire time I was there. The cook come from outside and made my food. Did he was hands before making my food???","useful":0,"user_id":"DAssyKNnYBenf0s1uP5iRw"}
{"business_id":"ZCsvwa_dsqNB8d8tYHPdjw","cool":0,"date":"2012-04-28 13:35:52","funny":0,"review_id":"ASZha3MiQJghtt3n5OGIsA","stars":4.0,"text":"This random hole in the wall is located in the Park Rd. shopping center.  I had never heard of it until that fateful St. Patricks day when another beer was in order.  After making my way there and enjoying the patio, I decided the food was my next venture.\n\nAfter my second, alcohol only, visit, I was excited to taste what vegetarian options they had.  I had the grilled cheese with spicy asparagus and portobello.  Let me tell you...grilled cheese is amazing, add a few interesting touches, it becomes addicting.  I was very happy with my sandwich.  Also, they have a very tasty appetizer of Goat Cheese Fritters with a red wine sauce.  Goat Cheese is one of my favorites and frying anything makes it better. I was in love.  \nTher service is great and they can accomadate large groups, the few times I've been has been with 7-20 people.  Great staff, awesome menu choices, I'll be going back","useful":0,"user_id":"Fyn9aNWs0Qcz6T-uIJal4w"}
{"business_id":"PZMpjUQ9_JVCf4Htu6vZYg","cool":0,"date":"2017-01-27 19:15:36","funny":0,"review_id":"if6UbmA8Z254rlIiKvYiAg","stars":1.0,"text":"((( LADIES BEWARE))) Don't ever take your machine to 35th Ave. sew and vac on Northern they broke my Elna machine while it was being repaired. I've spent over $10.000 at their store over the years and have been a long time customer .. Bill the owners son was so rude to me and did nothing to resolve my broken machine. I was disgusted when Bill the owners daughter wouldn't do Any thing to help me when the repair man broke my machine. It's terrible to bring a nice sewing machine in to be repaired and these people broke it while in their possession and they don't want to do a damm thing about it. It was like a big (screw you) to me. I won't buy another thing from these people for the way I was treated. Even the material is too over priced. I'm in the market for another machine but I won't go there ever again. My machine STILL NEEDS TO BE TAKEN CARE OF AND THEY STILL HAVE NOT RESOLVED THIS ISSUE. ITS STILL BROKEN AND IT HAPPENED WHILE REPAIRMAN WAS SERVICING MY MACHINE. I WISH I HAD NEVER TAKEN MY MACHINE TO 35TH AVE SEW AND VAC SHOP. WHY CANT PEOPLE OWN UP TO TAKE OWNERSHIP TO THEIR RESPONSIBILITY FOR THEIR OWN MISTAKES!!!! GO TO KINGS SEWING MACHINES MUCH BETTER SERVICE AND THEY DONT BREAK YOUR MACHINE!!!!!","useful":1,"user_id":"3owWXgw7_Czt5o35dVYOkg"}
{"business_id":"FYkm4c2CujTSPpqSM4TbuQ","cool":0,"date":"2015-05-12 15:46:57","funny":0,"review_id":"17KSQjHdowZMngVptW_KdA","stars":5.0,"text":"Great tanning salon near me, and clean, equipped with the latest tech and easy checkin and out spot for a short yet amazing relaxation and sunbathing time in chilli Cleveland. I am going to be obsessed with this place in winters and will recharge myself with vitamin D!","useful":0,"user_id":"wvBp1Ar-izuKnI9uBHWufQ"}
{"business_id":"aNe8ofTYrealxqv7VtFTuw","cool":0,"date":"2015-07-16 07:31:28","funny":2,"review_id":"XAm4_-lUxzF_Y449cWMHLQ","stars":1.0,"text":"Th service here is very hit or miss... Sometimes the staff is personable and attentive. Other times I ask myself, \"Why do I come here???\" The staff often has the  \"GTFOH\" stamp placed permanently across their foreheads, and we as patrons just have to go with it, otherwise we are deemed \"that guy.\"  I would say that my continuos visits were for the great HH, but there are several other options close to home, with the same food and drink options for me to choose from. I think today may be last visit...","useful":0,"user_id":"ABUt9wCHRsSpa8i7rtNAuQ"}
{"business_id":"CZKkoMlqu0N0zCFK-3T_Fg","cool":0,"date":"2013-02-21 21:25:07","funny":0,"review_id":"dcKpWjwqKl0ImVKEru6Q1A","stars":4.0,"text":"Great cocktails and very good food.  Overall first class restaurant.","useful":1,"user_id":"X-5IICsYwqImns4WxHi91Q"}
{"business_id":"ZNB91myFoOYgyXoG5LQeGQ","cool":0,"date":"2014-12-17 19:34:47","funny":0,"review_id":"36xxeOr4m4UlRf9FM1HzdA","stars":1.0,"text":"I took my wife out for a Birthday dinner with my daughter on 12-16-14  at Alfonsos.  I heard the food was good and it was and my waitress ( Dawn ) was also good ( even with it being very busy ). The problem I have is some of the waitress staff are rude. I had a gift card/ certificate to pay for dinner. After a few minutes, a big blond waitress came over and said  ( in a loud and rude tone ) I couldn't use it cause I needed to spend $100.00 in order to get $50.00 off. She then insulted me by saying (so the tables around me could hear ) couldn't I read the fine print telling me of requirements to use gift card. I showed her the certificate and the fine print was not legible She told me, sorry that's not our fault it's yours and she walked away. I am having second thoughts about going back to use gift card. I may give it away or toss it out.","useful":1,"user_id":"liUNZm0tOJJ-d-pFCdqu9A"}
{"business_id":"KjicU7uxRt2KDEnO5cgxDQ","cool":0,"date":"2017-06-27 23:17:40","funny":0,"review_id":"4aX4qoetCm45i4Phut_sww","stars":1.0,"text":"This company tried deliver flowers to our home- my son was home by himself and called me.  I had him keep me on the phone while he opened the front door (our security screen door was  locked though).  He told the gal that he was not going to open the door, that his mom (me) was on the phone and he asked the driver to call me, his mom.  The driver was very insistent about getting a signature and became argumentative.  My son kept saying, call my mom, she's on the phone now.  And she kept interrupting and insistent on a signature.  I told my son to close the door.  I then called the company and spoke with a Manager, Sara.  She understood my concern and said she would make sure the driver was trained on these situations.  Three days pass and I still don't have my flowers or a phone call.  I called and spoke with Sara and she had a completely different tone with me than previously.  She was very curt and tried to give me lots of excuses. I asked that the Owners call me.  Five days later, I've never received a call back from the Owner or my flowers.  I called to find out when one of the Owners would call back, and Linda told me it would be by Friday, which meant six days later than my initial request.  I told Linda that was pretty unreasonable and she told me that the Owners are busy and have several other businesses.  In my opinion, that's completely unacceptable- do yourself a favor and do not order from this Company.  They are very unprofessional and not very concerned about customer service.","useful":0,"user_id":"gt9w3MAaBemQsUCS_xapMw"}
{"business_id":"anzCdD5eIEHwydTpXhLlUA","cool":1,"date":"2015-01-03 20:45:05","funny":0,"review_id":"4PKiLkFTff9HK44QkOo6vA","stars":4.0,"text":"Heard about this place and was dying to check it put-and I'm very glad I did! Decent beer selection and kind of a hipster vibe, but $8 for a loaded hot dog and tater tots has got to be one of the best deals in town. Tons of unique toppings to pick from and delicious dipping sauces for tots (secret fry sauce was my fav). We were there early and had no problem getting a seat at the bar, but I can see how during prime time or when live music is on how it could be kind of tight. If you're going for the food is get there earlyu because that loaded dog would have been super hard to eat while standing.","useful":0,"user_id":"vDlrf84X8yu-CZ-8isrOSw"}
{"business_id":"z9aXGRH8xtqpNDFE5_I3KA","cool":0,"date":"2015-06-21 00:56:28","funny":0,"review_id":"QSe9EqmiImbguDVIraX_rg","stars":4.0,"text":"received a  mailer and thought okay let's go. walked in on a Monday afternoon greeted by a bartender wearing a cute  t shirt that said the bar and below that the baby. how cute however never got her name. looked over menu asked what was good she said the club. so ordered it and  yes it is good. had a beer a club on white toast served with fries and watched sport center. really felt at ease there and good music playing. will go back again.","useful":0,"user_id":"II8eB5mYk200GW-m-wpsug"}
{"business_id":"74C1z6cqEdvJVgETTcEodw","cool":0,"date":"2014-12-17 17:46:03","funny":0,"review_id":"x4FUjCh_QOOL4LEQQQM-6A","stars":4.0,"text":"Met an old close friend for dinner at Portofino.  Great intimate dinning with class. Excellent pasta and meat dishes. Delightful service and great drinks. Will come back!","useful":0,"user_id":"JggB3gMgP1j5aKHmC4vpBw"}
{"business_id":"smIh1HppyfXphiGMJPnZDg","cool":0,"date":"2018-04-27 18:32:25","funny":0,"review_id":"ReFXQwEtx_qyjC-G8RPviQ","stars":5.0,"text":"My company hosted a dinner and awards night at the hotel last night and the experience was the best we could have imagined! Working with Kristine Cole was fantastic and the communication was always on point. I walked in to be blown away by the set up and I had compliments on the food all night. I came into work today to be flooded with emails on how impressed everyone was with the presentation. The staff that was there to help us was GREAT! I believe Tim was in charge and he had Anna and one other gentleman with him and they made us laugh and gave us the privacy we needed. We will be back and I will be recommending them to everyone!","useful":0,"user_id":"Hxs41092f4HDP-q9_Q-RhA"}
{"business_id":"1HD5iUUfVJDbfEBIn9yVhw","cool":11,"date":"2017-03-15 02:02:13","funny":8,"review_id":"qdQIIf6xuyubxEG05e02TA","stars":5.0,"text":"Yes... the Boba Tea explosion is in full force. I have been to Lee Lee International Supermarket in Chandler many times, but I never noticed this little gem next to it until a couple years ago. Boba Tea House has serving up some of the best boba tea in the Valley long before it became a big thing. They have a fantastic array of flavors and drink choices to choose like fruit slushes, snow, milk tea, pudding, mango jelly, coffee jelly, etc. They even have snacks like popcorn chicken, fried tofu, and fries. The staff is super friendly and the prices are reasonable. I still laugh at my friends who have no idea what Boba Tea is or are too afraid to suck up one of those chewy ball things. LOL. In case you didn't know, Boba Tea is a flavored tea (usually with milk) to which chewy tapioca balls or fruit jellies are added. I think they are super delicious. Today I got the Blueberry Milk Boba Tea and it made for the perfect snack in the middle of my day. Another favorite of my mine is the honeydew milk tea.","useful":11,"user_id":"XPZVfP7DQCSL3Nb9t2vxsA"}
{"business_id":"CGUK3cd2gxp2q3KPY19Oog","cool":0,"date":"2018-04-15 11:34:34","funny":0,"review_id":"LrO2MkIWIjAoOeS5WImnrQ","stars":5.0,"text":"Yum!! Had the kale grits and would definitely have those again! Menu choices are unique, farm fresh and delicious!","useful":0,"user_id":"hzny0aF2jcUaY8rXN2bfJQ"}
{"business_id":"nDaW2hhQV5KYiGH7HzAOcg","cool":1,"date":"2016-12-04 02:34:48","funny":0,"review_id":"9X9G_UAQN5W3mmspIjsLXA","stars":3.0,"text":"I stumbled upon this ice cream store and seeing the high reviews on Yelp, went in with high expectations. First off, the prices are fairly high considering the size of the cones and cups they use. It's almost $4 for a small scoop, which is pretty overpriced in my opinion. Their flavours are a little more creative than most traditional ice cream stores and it is marginally creamier. The Noah I had was pretty neat with some different ingredients mixed into it as well. But, not worth that price and on some hot summer days, that lineup.\n\nAlso note that it is a tiny store that fits no more than a dozen people, so don't expect to sit inside enjoying your ice cream there.","useful":1,"user_id":"hTZb1INhnCG8URaFywVoYQ"}
{"business_id":"6xgcHeLad-VaoTIQewK84A","cool":1,"date":"2006-04-14 04:37:51","funny":0,"review_id":"VeJppsRLTWRKh4PkmcOzag","stars":4.0,"text":"ooooooh yummy.  i'm a red meat eating midwestern girl, and 9 had the best steak i can remember having in....who knows how long, it was DAMN GOOD.  the mac and cheese is a tasty, tasty side.  try the snicker dessert...it's basically two cookie/ice cream sanwiches with bits of snickers.  the s'mores my sister got were super fun too.  only complaint is that it was really loud and waaaaaaay too many annoying veil-toting bachelorette parties for my taste.  but hey, it is the palms.","useful":0,"user_id":"eJEcCIzJ5bqc0QpRGHSVCw"}
{"business_id":"vhIJ91MDgUuk4Cr9Kpj1Nw","cool":0,"date":"2015-07-16 05:40:33","funny":0,"review_id":"p9U8-Bj9tFBqHa-wgaDKJg","stars":1.0,"text":"Dreadful Service\n\nI've had Jimmy John's before several years ago in Minneapolis.. But apparently here in Phoenix, the store personnel must be trained differently. I had to take my sandwich back up to the counter twice to get the thick headed folks working at the one on Camelback at about 16th to get my sandwich the way I wanted it.\n\nI asked for a #10 Hunter's Club with all the veggies. What I got was the standard #10 Hunters Club with lettuce and tomatoes. \n\nAfter seeing that, I took it back up to the counter, and explained that I wanted all the veggies. They explained to me that those were all the veggies the sandwich came with. I carefully explained that I wanted all of the veggies that they have. The guy said, oh, you want the Freebies. I would have thought he would have clarified when I ordered whether I just wanted everything that came on the sandwich, or the Freebies as well. I said yes, I wanted all of the Freebie Veggies. \n\nI took my revised sandwich and sat down to eat it, only to find that along with the veggies I had requested, they had piled on Italian vinaigrette and Dijon mustard, which I did NOT want.","useful":2,"user_id":"1BcNXW9_Y16TIofPVpFqIA"}
{"business_id":"8KmqWgL0UEdxJFwTZ_YZvQ","cool":0,"date":"2012-12-04 03:30:31","funny":0,"review_id":"dS5ERxmIP-CQ_ZV_q_xc0A","stars":5.0,"text":"These burgers are phenomenal! The Galley Boy just melts in your mouth, and paired with the potato teasers and a milkshake it is like heaven on Earth.","useful":0,"user_id":"SYRRQJoa5gQ8Duev4uSWag"}
{"business_id":"E9HN0nA8eRsIBZYkL0H3xA","cool":0,"date":"2012-11-06 02:46:40","funny":0,"review_id":"XsBgj268rbYJ5ljKj02JxA","stars":4.0,"text":"I got stuck in Myrtle Beach last week and stayed here waiting for another flight.  Very clean, comfortable and right near the airport.  I would definitely stay again.","useful":0,"user_id":"THirRdo5CwitTPyqV28NyQ"}
{"business_id":"5qG4UHurI1yEozwn25WAFw","cool":3,"date":"2017-12-02 18:35:23","funny":1,"review_id":"m2H0m3pDUNmkXZP4K8c_oA","stars":2.0,"text":"#1 it should be advertised as a vegetarian dinner. For the price we paid, I really would have liked a nice cut of meat. \n#2. Way over priced. Dinner for 2 with (2) blue moon beers and (1) $10 glass of wine... $165+tip. We tipped over 25% because our server was great and the experience of eating in the Dark was a pretty interesting experience. \n#3. The food was Meh... I would have been okay with everything else if the food was outstanding. It really wasn't... I probably ate 3 bites of my dinner entree just to taste what the different Ingredients were... It was far from savory and could have used even a pasta or something. A couple of dry (what tasted like hush puppies)?? I would have been impressed a little if when I told the server that I didn't enjoy it if he would have offered to try one of the others, but I didn't make a big deal because like I said before he was really nice. The dessert was literally the only saving grace. \nAll in all I gave a 2 star... (server and experience in the dark)... I just have to be honest incase others go in expecting a non-vegetarian meal... Be ready for a $200 vegetarian dinner!!!!\n*** also if they don't like your review on their Facebook page they will block you from commenting on other people talking crap about you, they can not handle the truth and allow others to put you down ***","useful":5,"user_id":"fVK8D0rE9ez1fsQNW_bzRA"}
{"business_id":"yNPh5SO-7wr8HPpVCDPbXQ","cool":0,"date":"2017-04-30 05:32:05","funny":0,"review_id":"JYdhCDyR6lYfN2qnSspLlQ","stars":5.0,"text":"First off food is DELICIOUS! By far my favorite restaurant in downtown Phoenix. I have tried so many different things from the menu and it never disappoints, but the Saturday night special Prime Rib and Horseradish Dauphinoise Potato is my favorite. Second, the service is amazing. Ian is my favorite waiter, will request him every time! He is so personable with a good sense of humor! He constantly is checking up to make sure everything is good (but not too much). He made the experience at the Arrogant Butcher memorable!","useful":0,"user_id":"6kEFHccntnYMF_7cdqCcKg"}
{"business_id":"sk0stgY4NDJYOX1MbNJ3Pg","cool":0,"date":"2018-09-25 03:58:48","funny":0,"review_id":"SneRds-D0MCMWbIitd0AHg","stars":1.0,"text":"At least the Pinks concession stand by Section 3.  Unqualified servers who don't tell you that they won't take cash - and they seriously won't take cash.  Then the manager wouldn't even take the cash to another register. The lines are stupid \nlong and the workers incapable of handling the slightest issue. I m sitting upstairs if there is a next time I come to a Knights game.","useful":0,"user_id":"WThN-4czFfMs1vYhvaf_9A"}
{"business_id":"HhVmDybpU7L50Kb5A0jXTg","cool":0,"date":"2015-03-06 07:24:15","funny":0,"review_id":"29S2A-Q8Vt4a-Z6St1dcWw","stars":4.0,"text":"Wonderful experience. We sat outside on the patio and watched the Food Channel and listened to music while going over the menu and having a great conversation with out out-of-country guests. The patio is a good place for kids because the patio can drown out even the loudest child.  If you have a need for food with a great bite to it, this is the spot. We only waited 20 minutes for a table for 8 at the peak dinner hour of 7-8. Our server was quick to greet us and get our drinks to our table. We ordered the sashimi wonton tacos and sausage cheese dip with pretzels wrapped with pepperoni. Tuna was fresh. Wontons not greasy. Wasabi sauce with enough zing but not enough to over power the tuna. Pretzels and cheese dip was nice and hot. Pretzels sprinkled with parmesan cheese and crisp.  Entree's were big enough to serve two people! Beef brisket, beef short ribs, pork ribs, Caesar salad, bacon cheese burger all packed with flavor. Caesar salad comes with a huge garlic crouton, which my daughter cut up and we used it to finish up the sausage cheese dip! Caesar dressing was fresh. Corn bread and macaroni & cheese sides tasty. Ordered the cheesecake for dessert. It was large enough for our party of 8 and we left some of it there. Asked our server to put the pretzels, fudge sauce and potato chips on the side instead of on top, which they did.   If your stomach is sensitive, you may want to ask for the various sauces on the side because this isn't a place to miss. It's not that the food is spicy, it does the dance of the happy on your tongue and in your tummy. For some people, it may be too much but for me, this is a good thing!","useful":0,"user_id":"J6YedGZVdhagKKaIqgzIAw"}
{"business_id":"5n2dA_QqO4c_7pSK0Of6AQ","cool":1,"date":"2015-07-28 09:33:12","funny":1,"review_id":"DmlGGWLHPAQl2v9qM5noyQ","stars":1.0,"text":"I was told so many great things about this place but my entire experience was awful. The food wasn't very good, way too greasy. My fries were luke warm and my tray was literally covered in grease. I needed about 50 napkins and a shower after that. The service was pretty awful too. I can't believe I paid $14 for a small meal with no extra fixings. On national cheeseburger day of all days too. Such a disappointment and I've never gone back since. Best thing about it was the soda, but that's pretty difficult to mess up.","useful":3,"user_id":"8fpiTkK4MO5jJIXHFV4t5Q"}
{"business_id":"jg72eKbD8rlv0i1DRN5uxQ","cool":0,"date":"2016-10-13 20:59:22","funny":0,"review_id":"VukV341GHtm9kcvoKR-5vQ","stars":1.0,"text":"Came here for the \"midnight\" launch of the PSVR. After previously being told by another employee a week prior to get there at 6:01PM to get one of the six extra systems that weren't pre-ordered, and that it was first come first serve, I ended up not able to get a system. When I came in yesterday, the woman behind the counter told me they had written down names and numbers of people who wanted one a few days prior, and that they all were accounted for. \n\nThe previous employee even told me I was the first person to have asked about it. If they were organized, and told ALL their employees customers could put their names down on a PSVR, I could have gotten a system last night.\n\nNot only did this illiminate my chances of getting a system at GameStop, but made it too late for me to go to other department stores who had stock (as they were too far away, and lines were already forming at each location). \n\nNot happy.","useful":0,"user_id":"3Ft0HhzBP-iknnHt-PFX8g"}
{"business_id":"EgwGTDZ705TwudPJwAY0yQ","cool":0,"date":"2011-01-09 00:07:16","funny":0,"review_id":"W6VRRz7mVGZLsidyHelHwg","stars":5.0,"text":"This place is quite possibly my favorite restaurant in Phoenix. \n\nMy favorites are the Chicken Scarpariello, the pizza and the Sangria. My wife can't decide between four dishes. Our daughter loves the Penne ala Vodka, Lasagna, or Ravioli.\n\nMario and his sons work hard to please and we've never had a bad meal here. I've seen them bend over backwards to try and take care of obvious jerks. \n\nPlus to top it off, when local school invited local pizza places to present to a class on making pizza and recycling issues, Mario came and talked to the kids as if they were adults. All the other places treated it as a marketing event and brought coupons. \n\nGet the idea? It's all good at this neighborhood gem!","useful":2,"user_id":"To4ATBBNlnC5gzj0dwXfuA"}
{"business_id":"R_atwP6fr34SoXcOuGDp0A","cool":0,"date":"2017-03-27 01:42:21","funny":0,"review_id":"ER_W7XbsHuxs24UcLnTzWg","stars":5.0,"text":"Dr.K. & Dr.B. together with their Agape team are caring, professional, thorough and knowledgeable.\nDr.K. & Dr.B. will holistically bring your health & well being back into balance, not just treat individual injuries.\nEach visit is carefully tailored to your current state of being and needs.","useful":0,"user_id":"lOV7GDN5azjfW81xKma4Xw"}
{"business_id":"GdCRQU3VCh_x8fY84mbwYQ","cool":3,"date":"2011-02-13 17:46:55","funny":1,"review_id":"yMXmJzpEah6XfS_SSu920A","stars":5.0,"text":"Man, I love Toronto! Hiding in a strip mall on Overlea, find a dingy looking restaurant that serves up fantastic, cheap kabob...be warned regardless of when you come here you'll likely be waiting for a table as this place is always overrun with people...If you're a fan of perfectly grilled spicy meat, you must try this place out...now that I've been here I need to limit how many times I go here per month :)\n\nTake the drive out and have some kabob...if you don't own a car, borrow one or get a zipcar membership...totally worth it!","useful":1,"user_id":"MQq_1AlcDWsyNs7Ot8J4OQ"}
{"business_id":"PFmB_iraAbTN9XMka7soqQ","cool":0,"date":"2017-06-27 22:49:09","funny":0,"review_id":"m7eosmcK66RU_61UHbNMww","stars":5.0,"text":"Today was my first time seeing the staff at Bella Smile and it was a great experience.  Although I'm not currently living in Las Vegas I plan on coming back for checkups and any other problems that may arise.  There was no wait time whatsoever and I was out of there without a drop of pain or discomfort.  The manager Severn was very accommodating and will be getting business from my family and friends in town.","useful":1,"user_id":"0v0aVNJEixurV1Ib0iqzJg"}
{"business_id":"1Kq_blM7ROYESz6i6FI_QQ","cool":0,"date":"2013-05-07 03:40:19","funny":0,"review_id":"NfK6qaAr5QgbuMG0XDbpuQ","stars":4.0,"text":"I've taken my kids here several times, and we've never had to wait more then 5 minutes. We go right up, sign in, and they usually call us back right as I'm done signing their paperwork. The doctors have always been super nice. My daughter had stitches done, and she was a nervous wreck. The staff tried so hard to make her comfortable and gave her a stuffed toy when she was done. It was very nice. I wish they would open a bit earlier in the day...otherwise, they're great.","useful":1,"user_id":"-bFRtLmkx7aXKf0oqFKpRg"}
{"business_id":"Sxe7h922Dqv9HzfTH-8O7w","cool":0,"date":"2017-05-13 06:29:26","funny":0,"review_id":"xjHy2n06GoOGeYkABeRs6w","stars":1.0,"text":"One of the crappier Marriotts I've ever stayed at. The staff is nice and professional enough. But the fact that it's right by the frontage road along I-17, you tend to attract a seedier crowd. Also, with three floors worth of rooms here, guess how many washer/dryer they have for everyone? ONE crappy washer and ONE crappy dryer! Don't even think about washing your clothes on a Friday night. For a two hour period, I went to see if the washer was finally available, each time I was met with yet another load of dirty clothes inside. If they can't afford to get more machines, consider installing one of those number ticket dispensers! Just a thought. Maybe I would have a better shot of washing my clothes. I also considered sitting on top of the washer until the load was done, but that would be kind of creepy on my part. I will be packing all my dirty clothes with me and never come back here again.","useful":0,"user_id":"KS__VsKYJbz-40HdyzeQNA"}
{"business_id":"_iUlt5rm-15QoLw0MEEg5A","cool":1,"date":"2011-04-22 01:38:58","funny":1,"review_id":"LaSg1wlkosR6aSiuzxyo3A","stars":3.0,"text":"Beer, beer, and more beer.  It's definitely a low-key nieghborhood bar.  As an out of towner, I enjoyed it.  It felt like Pittsburgh's version of Cheers except grimier.\n\nUnfortunately, the kitchen closes fairly early on weekdays otherwise this place may have received another star.","useful":1,"user_id":"9QoXklTk-Fl1Q1Cy8fCbdQ"}
{"business_id":"sT6KKMATRTiNSJ896D7l2w","cool":0,"date":"2014-09-09 18:54:45","funny":0,"review_id":"ngN7BwOpWUPA5yhmjNew7g","stars":4.0,"text":"Love the crust on this pizza. The sauce is decent, cheese is okay, the pepperoni was not the best quality. \nMy friend ordered an everything slice, said it was good, just wished so cheese was on the toppings to hold it together.","useful":0,"user_id":"aXhMt_8ZDmfpr2QZ3zlmog"}
{"business_id":"Gyrez6K8f1AyR7dzW9fvAw","cool":1,"date":"2017-01-02 03:48:03","funny":1,"review_id":"l7KB334CXThAcmZPOvF1zw","stars":2.0,"text":"Normally, I give a restaurant at least 3 stars as long as it has good food. However, our group was quite disappointed with this restaurant. Granted, we were expecting a lot from an Italian restaurant in the Venetian, but I also think those are fine expectations to have when eating at these prices.\n\nFirst, we changed our reservation, and they said they could accommodate the time. Clearly, they shouldn't have. We were seated at a folding table in the hallway next to the restaurant, quite literally in the food court next to a kiosk selling trinkets to tourists. Whatever ambiance this restaurant might offer is a mystery to me. They shouldn't have switched the reservation if it wasn't possible to accommodate the change (our fault, wouldn't blame them). I know they threw a table together as our table and chairs looked different from the rest of the ones set up. A few were just in front of the restaurant but not off to the side like ours was.\n\nI expected to pay a lot in the Venetian, but I expected to be blown away. I would have preferred dining at several places we walked at on the way to this one. I paid $17 for spaghetti carbonara. It was very tasty, a well-balanced sauce with a decent amount of pancetta. However, I finished the whole thing. I can't finish an entree at Olive Garden for the same price. I also ate a few pieces of bread. One of my friends ordered a chicken kabob (who knows why that's sold at an Italian restaurant). It was one single kabob with perhaps 4-5 pieces of chicken and 4-5 vegetables on a bed of rice and it cost $25! Absolutely outrageous. \n\nTo top it off, we told the waiter we were celebrating a birthday. He said ok, so I expected we would receive a dessert, as is customary. We received nothing. Of course, our waiter didn't seem keen on giving us the time of day so I don't know why I expected him to remember a birthday.","useful":3,"user_id":"N6zhXHPIrCXommDEg0Rw3g"}
{"business_id":"xS5HGqgk0KY2jFWU-l_nrA","cool":0,"date":"2018-09-25 03:54:06","funny":0,"review_id":"RKGH2ZQHyBNgJwQ84lKMFg","stars":4.0,"text":"I'm not that familiar with Scottsdale so I'm just guessing that this restaurant is fairly new. The atmosphere is great and lively but s but loud. They have a huge wine and drink list. \n\nThe food was really good, I highly recommend the ahi tuna appetizer, ravioli and the skirt steak!","useful":0,"user_id":"pHKISjytTmP0LrP952_32w"}
{"business_id":"XXW_OFaYQkkGOGniujZFHg","cool":0,"date":"2018-02-23 23:07:48","funny":0,"review_id":"kQAHUQ89fIZVCf1cFKDE_Q","stars":4.0,"text":"\"Good morning, cocktails for you?\" \nWait...what? Oh...it's Vegas!\n\nDining here, you best not be dieting because this place is literally the definition of excess, but in a good way. I'm a sucker for benedicts so that was awesome. \nService was really great too and the staff was so welcoming. It was our first stop just after landing so really appreciate the service.\n\nBack in Hawaii this reminds me of Zippys or Anna Millers - that home feeling. Prices are a bit high, but for what you get it's totally worth it. Will remember this place if I ever return to Vegas in the future.","useful":0,"user_id":"dL1qnksdX2LW4DbNI9XNoA"}
{"business_id":"HhVmDybpU7L50Kb5A0jXTg","cool":0,"date":"2016-01-30 01:08:03","funny":0,"review_id":"jdDxglqBqPJPYQO5QlY8pA","stars":5.0,"text":"Hands down best Bloody Mary ever. So many things in my BM, veggies  mmm bacon.  \"Nailed it\" it's an appetizer. I also had the burger with fries. Who knew fries could be so good. The presentation doesn't disappoint ether. Very nice. Great seating outside although we sat inside. Would love to see this restaurant near my hometown. Seriously. Get the BM. You rock Guy!","useful":0,"user_id":"2Klw_6aXH_aVcOXPiFHRzg"}
{"business_id":"PycR_Mr5jA9jB4Xg3nX0Yw","cool":1,"date":"2014-01-17 02:15:25","funny":1,"review_id":"h7Rmb3EiXjajVfGYNa5CuQ","stars":1.0,"text":"They charged me twice what I expected to pay. The guy at the counter small-talked me, asked me if I wanted \"any additional insurance\" - I said no - and just initialed where he told me to, not noticing that one thing I initialed was collision waiver insurance, which I did not need and ended up doubling the original cost. He did not walk me through the additional cost and may even have been purposely misleading by distracting me with small talk. I am an experienced traveler and nothing like this has happened to me before. When I returned the car and expressed my surprise at the doubled cost they essentially said \"well you signed it\" and \"it's worth it anyway.\" I will never rent from this Payless again.","useful":14,"user_id":"oAOE4UAC5ZbAjEGBEMCb4g"}
{"business_id":"0Yeb_P24sj6MwG2qmuehkA","cool":0,"date":"2018-08-23 21:19:30","funny":0,"review_id":"b5f0MzgbgUIcFy1yLueRGA","stars":4.0,"text":"Quiet bar and grill great waitress and the margarita pizza was very good. Small sign out front and almost missed the place.","useful":0,"user_id":"fX_E3GLT8iwc2M8Thy2wmA"}
{"business_id":"1A1b0ELki8v-C-0VtdoGAg","cool":0,"date":"2013-09-04 01:21:35","funny":0,"review_id":"V2alPCkzmHqTF8u2JKPiOA","stars":4.0,"text":"They came out when they said they would, did the job in the amount of time they said it would take for the amount they said it would cost. They sold me exactly what I needed to hopefully keep my basement from flooding and didn't try to sell me a bunch of things I didn't need, subsequently their quote was 1/3 of those other waterproofing guys and I'm willing to bet my basement will stay dry just as long! Thanks to Nick's crew!\nThe O'Donnells","useful":2,"user_id":"ag5GlfKKtjcnNw2VgVxNRg"}
{"business_id":"ZLuWpmvO41w2bSwufgfUlQ","cool":3,"date":"2010-08-20 22:38:10","funny":0,"review_id":"XRCS5zr29DOxlCXKKKwwAw","stars":5.0,"text":"This is my first yelp.  This restaurant was soo good I felt compelled to yelp about it.  Went for dinner with a friend of mine, really nice space.  All the staff were amazing!!  The chef even came out to our table which was cool.  And the Food, well I think even the most discerning top chef judges would be impressed.  A++ across the board.  We had the tenderloin and mac and cheese.  As well as the tomatoes two ways both are excellent choices.  I can't wait to go back.  Cielo, kudos.","useful":1,"user_id":"2ROluW4TNFbkO3qLtihhaQ"}
{"business_id":"xHZmM-kGXqOfmQNTm0T05g","cool":0,"date":"2016-10-26 15:34:31","funny":0,"review_id":"m14cjbICuRRASAitrh_YXA","stars":3.0,"text":"Overall the food is really good. We had bruschetta and it seemed to have just a tad bit too much olive oil on it. Had it had anymore on it we would not have eaten it. My husband had chicken Parmesan and I ordered a salad with grilled salmon. He said his tasted good and my salon was cooked perfect. I also enjoyed whatever the dressing was, I just wish it would have been on the side. For whatever reason it was poured on and also came with a cup of it on the side. We agreed that the prices seemed a bit high for the experience. It has a similar feel to Bravo but service just isn't at that level yet (from our experience). Our sever did not know anything about the menu or what is fried in their fryers which should be expected at $18+ a plate. (We asked because of food allergies) She did however make sure to note allergies on our order which we appreciated! The music also did not match the setting. I really wanted to relax but the music was super up beat and almost had me rushing to leave. We will try again in a few months and I'll update my review then.","useful":1,"user_id":"dW6bAWM1HbPdk_cGS_a2HA"}
{"business_id":"01o6K5ID_vW8tXZ7QAzPJg","cool":0,"date":"2017-11-06 17:58:01","funny":0,"review_id":"VRlBw70YHxje2n42IEOw6w","stars":5.0,"text":"PRC consulted on 2 tile roof replacements at apartment communities we manage in the greater Phoenix area. PRC was thorough and caught a number of items the roofer needed to correct on both jobs. Their communication was great. A roof is a major investment and having a professional help manage installation is money well spent.\n\nThe specific services provided were initial condition and spec reports and roughly 5 job inspections per property.","useful":0,"user_id":"n5lEgdrkMlQd0_myn51j9g"}
{"business_id":"zk3AimWhuz0EZsNgIddKdg","cool":0,"date":"2018-01-09 21:27:45","funny":0,"review_id":"_HZMf8j6F0jx0nUlea5m2g","stars":1.0,"text":"Awful place. Staff is not nice, very rude.  They never seem to want to help at all..Their service is not up to par & always out of bagels","useful":1,"user_id":"v7FPnMzdbl6J7U_8H1BWZA"}
{"business_id":"LprNAY4S7Vthc-hnqLI3Pw","cool":0,"date":"2018-01-09 21:17:22","funny":0,"review_id":"MSN9bcoEhSsDv5oiIlO4mA","stars":5.0,"text":"So many great this about Yoga Factory! Excellent teachers, very friendly and professional; they have been very patient with my practice but know how to push me to meet my goals. Amazing location very easily accessible very easy city parking! Nice large space in the hot room, never did I feel like my elbow room was compromised and the room can get PACKED! The facility is clean, neat and I love the choice of decor. Highly recommended for a first-timer or for someone who has a frequent practice very friendly and welcoming place.","useful":1,"user_id":"YZ7AZjkfvZIIMs-erSljiw"}
{"business_id":"qaPSbg690KaX5av6xsSV4Q","cool":0,"date":"2013-05-28 20:38:13","funny":0,"review_id":"IWinoppaEcMt5DrreAUR0Q","stars":1.0,"text":"I have no idea what the owner's problem is, but he's incredibly rude. His wife, on the other hand is super nice (an odd mix).\n\nGreat space, rude owner and the coffee is average.","useful":4,"user_id":"U2sN2-HGvh27FyXKFlvkBg"}
{"business_id":"r5PLDU-4mSbde5XekTXSCA","cool":0,"date":"2013-01-27 17:54:54","funny":0,"review_id":"lDJIaF4eYRF4F7g6Zb9euw","stars":4.0,"text":"I used to work food service and my manager at the time recommended I try Defalco's. He knows food well so I was excited to try one of his favorites spots.\n\nThis place is really, really good. Lot of authentic Italian choices and they even have a grocery section with tons of legit Italian goodies. I had a Chicken Parmigiana sandwich that was to die for. Anytime my ex-manager comes back to town (he left for Vegas and I think he misses Defalco's more than anything else in the valley), he is sure to stop by and grab his favorite grub.\n\nParking is a bit tricky during busy hours and the wait times for food can get a bit long, so I recommend calling your order ahead of time (unless you want to take a look around while you wait, first-timers).","useful":2,"user_id":"lb0QUR5bc4O-Am4hNq9ZGg"}
{"business_id":"RBGGLBIOsn8rxv5Nott4zw","cool":0,"date":"2014-11-12 15:29:08","funny":1,"review_id":"jjXMzyIn4kpBUOKsTrAp5Q","stars":5.0,"text":"Early this past January, I needed to find a furnished rental in the uptown Charlotte market. I really had no idea of how or where to look. I was glad when I found the Sold on Charlotte site.\nAs I recall I traded a few emails and phone calls with Chip and he was helpful in answering all my questions. We met at 626 North Graham and he showed me the unit there that was available.\nBetween Chip and Sylvia, I was \"sold\" on that apartment and we got the \"paperwork\" going. I enjoyed my stay there which lasted 6 months (3 months more that I initially signed up for).\nWhen it came time to give my notice, Sylvia gave me all the details I needed, and these were pretty much the same that were in our initial Lease Agreement. They were kind enough to give me ample notice to show the apartment during my last 30 days, without too much inconvenience. Sylvia helped me tie up a few loose ends and even arranged to pick up a lamp for me that needed to be repaired when I moved out.\n \nI would certainly reach out to the team at Sold on Charlotte again.\n \nKind regards,\n \nJohn D","useful":0,"user_id":"-ifGqKj4_GZIPGcR5ox-xQ"}
{"business_id":"9nTF596jDvBBia2EXXiOOg","cool":0,"date":"2014-01-17 02:02:59","funny":0,"review_id":"5K0whjm5M3QCRLFkgb7ecw","stars":5.0,"text":"I really enjoyed coming here, it located near walnut st which meant parking was difficult. \n\nWhat I didn't realized was that hot pots where individualized. They gave a pot over an electric hot plate which you can adjust the temp. They also have hot water on the side in case you run out. Very fulfilling for $15.\n\nIt's a small area and they also have a section for you to customize your own sauces.","useful":0,"user_id":"9q0f4vm589zztMgR4INpZg"}
{"business_id":"AfEOC5LlBeMt708QEQUihw","cool":0,"date":"2014-11-30 00:36:24","funny":0,"review_id":"WD-cSY1y13oRdY77EjZL_g","stars":1.0,"text":"Ok so I have purchased items from RC Wiley and have spent a lot of money but will never again. I had a $500 credit limit after I purchased my fridge and when  iwent to use it towards ny bed room purchase it was no longer available due to me paying it off too soon????? (Apparently since I paid $500 in 2months instead of $25 in 10 months) When we attempted to question what they meant and if there was anything that couldbe done the supervisor emele pretty much told us to take a flying leap -are you serious!!  So I spent my $2300 at Ashley furniture. RC Wiley apparently is balling and they don't need me to buy anything. Good luck! when u have poor customer service reps representing you like that their making your company look bad.","useful":2,"user_id":"LmLFkgMGX5X9G1FOM06iOQ"}
{"business_id":"OqF8enx9gNcgWgdODPYDLg","cool":1,"date":"2017-04-07 21:40:45","funny":1,"review_id":"YcQtB8zQlsoxpgDNZphIzA","stars":1.0,"text":"Let me start by saying that I love Aveda which is why I decided to try this salon... and it was a big mistake. I explained what I wanted to the stylist, and even showed two photos. It's easy to get this cut wrong since it's short hair, so I also showed a photo of what exactly I DID NOT want. She asked what I didn't like about the photo and I explained it (it's a section in the back and she acted like she understood). The cut finishes, she spins me around and it is literally EXACTLY what I showed her that I didn't want. I was mortified and now trying to grow this hideous cut out. Nothing is blended and she butchered my hair. And to make matters worse, she wasn't even friendly! Heading to a different salon today to try and get it fixed.","useful":1,"user_id":"GvAc-axxNt817YfptzASEg"}
{"business_id":"Z1wApYkrMmMQinjDdbSLbg","cool":0,"date":"2015-10-07 22:45:03","funny":0,"review_id":"QMVMeS2sAGCLTWlkyHIaDg","stars":1.0,"text":"Place took forever... Come to find out that they didn't have my oil filter and a hour and a half into me waiting the Napa parts guy pulls up and 10 mins later it was done... Hmmm.. But they didn't even let me know what was going on! Never going back","useful":0,"user_id":"k9lY8q4dvX8BwCE2n4PpBA"}
{"business_id":"DmuU3QC1AM9LPb_J8L2FGA","cool":1,"date":"2018-08-04 20:32:55","funny":1,"review_id":"pGPkT0dNzUwsD5K-F7XVcw","stars":5.0,"text":"Cutest little dive bar in the city! Chill vibe, cheap (and yummy) drinks, delicious food, and family owned. Laura was an excellent bartender and made us feel right at home. Bonus points because it looks like a cute little house! A must-see if you're in the area.","useful":1,"user_id":"HQlMQTF9wckTGfKG9Ljtvg"}
{"business_id":"F8lC8jHCykqPy0h2AJ9lnQ","cool":0,"date":"2018-05-19 00:40:27","funny":0,"review_id":"elaCi73yKK_F4X_JpD6T8g","stars":4.0,"text":"Really happy to have such a unique place like this in Phoenix. The Tea was tasty and the interior is very well laid out. Will definitely come back!","useful":0,"user_id":"3X1-GIl0tym4ZIwef4NNhA"}
{"business_id":"cPEo3-TmIqCwHLFGKZgwGg","cool":0,"date":"2017-03-15 02:07:10","funny":0,"review_id":"ms7jlesqKq-1RE-yDaOxBw","stars":5.0,"text":"These darn Northerners really know how to make some goooood eggplant. I am obsessed, like seriously obsessed with their eggplant minced pork dish. it sounds so simple but never have I had it this good. Everything else on the menu is decent, the dumplings, XLB, noodles, etc., but the eggplant is to die for! Go for the authentic side of the menu avoid the Americanized dishes.","useful":0,"user_id":"fMQm1xCaEckajci8EHLgoQ"}
{"business_id":"HoSDjKKR8GtpeSqzrwf8ew","cool":0,"date":"2017-07-28 18:10:13","funny":0,"review_id":"bVjFkzjYEn9_JfDs-_mGzA","stars":1.0,"text":"the few times i ordered from here i was greatly disappointed. freezer burned strawberry ice cream, microwaved food and run of the mill breakfast.","useful":0,"user_id":"6KdJciNw5ja42-5XSFb3Fw"}
{"business_id":"1XOty79t4o_e3v0OOw8LTA","cool":2,"date":"2017-07-28 17:55:02","funny":0,"review_id":"JTvVNbqHbdLq3zeuxtjoug","stars":5.0,"text":"We have had a wonderful experience with Dr. Beals treating our son. He's been seeing him for about 8 months now and are very satisfied with the care he receives here. Dr. Beals is very helpful, we never feel rushed to get out of his office and he's patient in answering our questions. One of the things I most appreciate is that I've never felt like his solution is to throw a bunch of meds at my son. He's conservative and has started on low doses, moving up only when we were comfortable. My son loves coming to the appointments and playing with all the Minecraft toys in his office!","useful":2,"user_id":"qOiMHf9eBZhsvDSqauIiug"}
{"business_id":"EdY6q0CO2mlATpoTFkvHAw","cool":0,"date":"2017-02-19 08:49:25","funny":0,"review_id":"rHGTcKIfLTE9Y26aNJ__Yw","stars":2.0,"text":"Just ok. Not a fun true busy dim sum place and I'm so sure they don't make their own food. Won't be back soon.","useful":0,"user_id":"zN4M-hA86ps5I6BwXoqcqA"}
{"business_id":"HkbNItNrnXlNo59M0YyoMg","cool":0,"date":"2016-09-30 19:51:43","funny":0,"review_id":"a6N51Ov3NEchmqsquNGtMA","stars":5.0,"text":"I've been coming to Loco on mill since they opened. I love coming here especially on Sundays for football. They have all the games on, great bloodys, and awesome breakfast!  Loco is my local watering hole and I always have a great time with the staff.","useful":0,"user_id":"qpYllTutvfoKvT5OEl7gGQ"}
{"business_id":"4RA3hdiiC3vuiaSIraZ28g","cool":0,"date":"2017-09-20 14:53:23","funny":0,"review_id":"sdMeynFmJknSQq1zUV2fUQ","stars":4.0,"text":"Ordered combo 3.  It comes with two plates or rice (or bread), one skewer of chicken breast kebob, one skewer of koobideh, one skewer of barg kebob, 3 grilled tomatoes, a plate of parsley and sliced radish, a bunch of basil.  No salad.\n\nThe meat were all very flavourful, not dry and juicy!!! The taste was very good.   Definitely a lot of food for two people. :)\n\nThe waitress was very friendly and attentive.  \n\nI read another review that they do not accept amex, and yeah they really don't.  But I asked before I paid for the meal so it's ok.","useful":0,"user_id":"Ouu5ycmS2EOtqPbk6JZvTw"}
{"business_id":"PVHuPORXFRlHOOP7ePTakg","cool":0,"date":"2017-07-08 17:24:01","funny":0,"review_id":"7FNSeiMo7UqaPQXvU2lzrQ","stars":1.0,"text":"Rebel doesn't take credit cards and charges you to use debit. Not very convenient for people going to the lake. We will just fill up elsewhere. \nThe place is filthy, too.","useful":1,"user_id":"XLLtQvZZjCFLjwatsMnetA"}
{"business_id":"biSsdqExmdvIKiFuowOadg","cool":0,"date":"2015-01-03 22:17:56","funny":0,"review_id":"z1rYuaKCL6xkacLIIaxr_g","stars":3.0,"text":"The decor and everything int he restaurant is really nice and sheik looking. We got the Resting Panda and the Whiskey sour, both of which were very tasting drinks. We started with the Foo Foo plater (just to be able to try a bit of everything). It was pretty good actually, I'd highly recommend it! Our server (i believe her name was Nicky) was super awesome and really nice and helpful. She decided on getting the pork belly ramen and two sushi rolls. The ramen was good, a little salty, but I'd recommend it. Then we received the Spider roll, which was great. Next up was the Crispy roll, which was where the problems arose. We had to wait over 45 minutes for one roll. After about half an hour they finally brought us a different roll to apologize for it taking so long. Apparently they didn't have the crispy rice prepped so that was what was taking so long. I myself am a server, and although the server came over and apologized several times, it probably would have been a good idea to have the manager come and apologize. We finally got it and it was okay, and they ended up comping it, which was nice. I'd give this place one more try...But I most limey wouldn't order the crispy rice roll again.","useful":0,"user_id":"9iMIjdMY99_igb1FmBXbwg"}
{"business_id":"9mIm1ef-NVDQHFE39Faxxg","cool":0,"date":"2018-08-04 20:36:55","funny":0,"review_id":"P1SXso5nMKwhHyTW6OIIIg","stars":5.0,"text":"Hey....i just want to say, everytime I eat here, since the late 90's.  Nothing but good wings, good beer, and good times.  If the waiting staff is terrible, slow, non attentive, so be it.  I eventually get my food and beer, im busy either catching up with friends or pull out the cell phone and chat with friends.  Weird but there it is.  Have Fun here..........Cheers!","useful":0,"user_id":"OuRmjIT8yj8w04XsLX1tlg"}
{"business_id":"tjAeaGdxf7I4xN9M7wGJNQ","cool":4,"date":"2014-07-13 14:32:56","funny":5,"review_id":"TaoaX7MqCujFRNaJBns2Sw","stars":5.0,"text":"While the prices are a bit high for a make-your-own pizza, the taste makes up for it. I love going to Seventh Street market, sitting Not Just Coffee and having a drink while waiting for delicious fresh made pizza from Pure.  I've taken this to go as well as eaten inside the market, and I can say that the pizza doesn't do well reheated. So try to eat it fresh while there if possible.\n\nIf one of their specialty pizzas sounds good to you, go for it, as those are definitely a better deal for the amount of toppings you get for the money.  I wanted what I wanted, though, so I ended up with a medium, thin crust, regular crust pizza with jalapenos, pepperoncini, onions and feta.  It was pretty expensive at $2/topping = $20 med pizza. But it was delicious.\n\nThe arugula salad with goat cheese and lemon vinaigrette is to-die-for. I crave that dressing days later. So light and fresh but flavorful.","useful":8,"user_id":"x37OyP--VEFE5p-xreplYA"}
{"business_id":"JN6287XepTV2wOiwnq5joA","cool":0,"date":"2011-02-13 16:59:31","funny":0,"review_id":"miAbIuIln8YfLoo6rf3MyQ","stars":3.0,"text":"Visited this restaurant after a 3 hour drive to get to it.  We, my boyfriend and I,  saw their ad on their website for an $$85 per couple Valentine's Day Dinner.  We had reservations for 6p.m. this reservation was made on Friday, we dined on Saturday. When we arrived right at 6p.m. there were plenty of OPEN tables in the restaurant.  When the hostess looked for our name on the reservation list it showed we were to be sat at table 14.  The list said in large print at the top..DO NOT CHANGE TABLES.  The hostess walked us past 8 - 10 2 person tables to sit us at a 2 person table literally 6inches from the neighboring table!  Could we have asked to sit elsewhere? Apparently not as the hostess was under direct orders not to change tables.  Could we have dined elsewhere...probably not considering it is Valentines Weekend and we drove 3 hours to get there and have no reservations any where else, and no idea at 6p.m. where to go.  \n\nSo we sat.  We could hear EVERY WORD the table next to us said. (Which by the way when you take your pregnant wife out for Valentine's Day you probably shouldn't answer the phone when your buddies call or talk about how \"hot\" her female coworker is.)  This was so awkward, you had to watch every word you said to be sure the neighboring diners weren't eavesdropping on personal info. Most uncomfortable \"romantic\" evening of my life...\n\nNow to the food.  The Valentine's Day meal was a choice of appetizer to share (except for one - they sold out the night before), a \"salad\", choice of any appetizer on the menu (again except for the New Zealand Rack of Lamb, because it too sold out the night before.), a Chocolate Creme Brulet to share for dessert, and a bottle of Nero D'Avola (which we were told is a $35 bottle of wine). We ordered two bowls of soup to go along with the special.\n\n\nThe soup - Lobster Bisque (Delicious) and Minestrone with sausage ( missing the sausage and the vegetable were literally giant sized. It was like eating a salad with broth and rice in it). However it did taste quite nice.\n\nThe appetizer - Artichokes with Prosciutto.. YUMMO!\n\nThe salad - hmm not what I had in mind. A tiny plate of Feta Cheese, cucumber, pear in balsamic vinegar and gosh knows what else...but NOT a traditional salad..So beware!  Taste was great, but if you are expecting a bowl of leafy greens and some toppings...This it is not.\n\nThe meal - Veal with shrimp and gnocchi..Quite pleasing to the palette.\n\nThe dessert - Chocolate Creme Brulet...   Umm not so much..it was quite clearly 3/4 cup of Chocolate Mousse with a sliced strawberry on top and a store bought sugar cookie in the shape of a heart.  Yes it did taste good, however...where was the Creme Brulet the waiter raved about?\n\nThe wine - Nero D'Avola...yes I am a red wine drinker, the wine was delicious.  But upon looking it up when we returned to the hotel room...found it only sold for $10 - $13 a bottle...Why the lie? We would have ordered the special anyway...\n\nThe atmosphere...beautiful, romantic (if you like sharing intimate moments with strangers) but it was pleasantly dark with candles and Christmas lights through out. They had an electric fireplace when we first sat down we observed and enjoyed the heat coming from it, since as you know we dress up, not dress warm when going out to dinner. The place lost half of its power 5 minutes after sitting down. The manager  chose to turn the fireplace off, even though it stayed lit and running during the power outage.  By the time I left, my toes were frozen.\n\nWe finished eating and paid for the bill at 7:50p.m. I turned around and noticed FOUR empty 2 person tables. They had never been sat, but we had to sit with an unfamiliar couple! \n\nUpon leaving the hostess who was so sweet and friendly upon arrival was short and sarcastic in her good bye and have a nice evening.\n\nWould I go back when in town again? No.  At the risk of being sat in that situation again.  The food can be the most delicious in the world, but I still prefer and deserve privacy when dining.\n\nAnd to the lady we sat next to...Good luck on your birth, maybe your dislike for cheese will go away after you give birth.","useful":0,"user_id":"7-Wb8rDEymidPPfShLX3Yg"}
{"business_id":"w6F502EKMyn3ONbGT2bQxw","cool":1,"date":"2015-08-30 13:17:23","funny":0,"review_id":"_LPOtmfWnL_8_tL3ImhoLw","stars":5.0,"text":"Not sure why some posted negative reviews of this place because it is on point. My girlfriend and I had dinner there last night, with reservations set for 6 p.m., were seated by 6:05. Our server William was awesome, was fast, attentative and really was one of the best servers we've encountered and we dine out a lot. We both ordered all you can eat crab legs and they were fresh, hot and delicious. I do feel the sticker price was high but we must have had 5 buckets each so it equates to 10 bucks a pound. \n\nThe only negative I did feel could be addressed is the tables are made of some type of epoxy resin so being outside, May be melting or something because there was a sticky residue on the table top. I just played a napkin over it so it was acceptable. \n\nMy girlfriend and I will definitely be returning to pickle bills, we had a fantastic evening. Last thing to note, the service was great even though the place was packed!","useful":1,"user_id":"91DAiIKXri-41uzYue2hlg"}
{"business_id":"-4TMQnQJW1yd6NqGRDvAeA","cool":0,"date":"2013-10-24 03:19:44","funny":0,"review_id":"pT5KSTwYBtKoDG61filWXw","stars":4.0,"text":"After being a HUGE fan of the Mission I decided to try this place out seeing that it's owned by the same owners even though I was very skeptical that it could possibly be as great. To my surprise it lived up to what others had told me. The ambiance was amazing. Very much like the mission. Candles light up the entire place. The outside patio is quite large and there is a lot of seating available. The staff was great and very helpful with making suggestions on the menu. My favorite items on the menu are the scallops and the Apple caramel upside down cake. They were cooked to perfection and melt in your mouth. They have a great wine list and its a perfect setting to enjoy a few glasses of wine:) This is a great date night spot that I recommend it now to all my friends.","useful":0,"user_id":"TAxEXlveQ5JrRsZ3Uta8BA"}
{"business_id":"ulg83kbgFzXOawlIkfpLww","cool":3,"date":"2014-04-19 13:06:06","funny":1,"review_id":"SZrbK4K4YaiDMfkUuYGiNQ","stars":2.0,"text":"I've tried to shop at Montblanc Toronto several times but the selection is very limited and the sales staff while attentive, not very friendly. Recently I tried to replace a ring I received as a gift and lost.  The Toronto store was quick to identify the style number of the ring but said they no longer had stock and couldn't help me, I asked them if they could check other locations with no avail.  \n\nBecause the ring had a lot of sentimental value I decided to call the  Hong Kong location where the ring was purchased. Over the phone the clerk, Jane, and amazing representative knew the ring as well and again it was out of stock but she offered to check with head office in to see if any exist  at any location world wide.  She called me the next day from Hong Kong to inform me she found the last ring in London and it was now in transit to her store where she would hold it for me until I return to Hong Kong in a few months.  Not wanting to risk the ring getting sold or lost, I paid for it with my credit card over the phone and arranged for a friend to pick it up and send it by courier.  The ring now sits on my finger never to be removed again :)...  This is the type of service that builds loyalty.  \n\nThe Montblanc store in Hong Kong is located in Pacific Mall. Jane has since been promoted and transferred to their flagship store on Kowloon Side on Canton Road. I'm not surprised of her promotion given the service she provided me.  I will be forever be loyal to the Hong Kong location. Thanks Jane!  I'm giving 2 stars to the Toronto location, the Hong Kong location would easily have 5 stars.","useful":3,"user_id":"VrMaL32wWNed_DjOcsO3Ng"}
{"business_id":"-1xuC540Nycht_iWFeJ-dw","cool":1,"date":"2015-12-20 20:32:43","funny":0,"review_id":"m1sRMnzfUx_OffTU9tfCZg","stars":4.0,"text":"Trs bon poulet avec la petite sauce piquante c'est succulent . Beaucoup trop de frite dans les assiettes . Il n'y a pratiquement pas de place dans l'tablissement et il faut souvent faire la file pour commander . Mieux vaut prendre en take out . Jai pas goter  la Poutine mais a va l'air intense . J'ai eu envie de donner trois toiles tant donn la file et le peu de place , mais tant donn qu'il s'agit d'une des meilleures rtisserie portugaise ( oublier l'infme Piri Piri ) je lui en ai mis quatres .","useful":0,"user_id":"uNxljtnKZHvsdMZ8ZFRffw"}
{"business_id":"qfBp53c7Z2DpqUrGhV80zg","cool":0,"date":"2018-07-17 00:36:37","funny":0,"review_id":"dUegRzXd5-9g7B4-GRSGUg","stars":5.0,"text":"Best Thai food ever! Love the mango curry especially and everything. They have great bubble tea too. Very nice service very polite.","useful":0,"user_id":"UF32lXb79D29HIk0BWdqWA"}
{"business_id":"XvyXWS78g2soxHElyfgELw","cool":0,"date":"2017-12-29 14:30:34","funny":0,"review_id":"vxUvLAojLKEOftyJJweNEA","stars":5.0,"text":"We've shopped there for several years and always enjoyed the savings but this year I'm shopping for hoodies for the less fortunate.  Thank you Antigua.","useful":1,"user_id":"z4qE-IdYzvpzE8jP9oZYww"}
{"business_id":"YF4QJ_j-PM7cMZja6K1MwQ","cool":0,"date":"2018-06-19 06:58:18","funny":0,"review_id":"h41f8n78an6ZdhRzKMCT1w","stars":5.0,"text":"What an awesome pool party!!! I wish there was a tad more interactive aspects. I want hot girls and guys spraying champagne all over us or dancing with us.","useful":0,"user_id":"JXfRZ2jlLfU1BSeG_rw6Jg"}
{"business_id":"N06GSdupPPte-hP0YRFtdA","cool":0,"date":"2014-06-27 23:14:34","funny":0,"review_id":"oMKVNZp6C8866Lz_8HMoyg","stars":5.0,"text":"I LOVE this place! I have found the staff to be extremely knowledgable, beyond helpful and always willing to go above and beyond to do whatever they can to assist you. This store carries products that I can't find anywhere else besides online. They are great about returns if you have a finicky eater (like mine). \nI also love that they have no agenda when it comes to helping you select a certain food. They listen to what you're looking for and then make suggestions based on the info you've given them. They're also well versed in the latest pet food recalls (which are hard to stay on top of these days!)\nIf you sign up online, they offer discounts and specials all the time which helps with some of the pricier food. Organized, clean, and a huge selection. I have absolutely no complaints about this place... Except maybe that when they hold weekend pet adoptions I get depressed that I can't take all the animals home.","useful":0,"user_id":"r31sCain9mZlv6E9eZUv0g"}
{"business_id":"2_ngZCEtgrzZzUF-pwTVcA","cool":0,"date":"2017-10-24 20:41:30","funny":0,"review_id":"c-TBsj0-nZI6x6l93n288A","stars":1.0,"text":"I just had a terrible experience with Dr. Jennifer Vonya-Novak's front office.  I changed my primary care to Dr. Novak.  It took me 3 weeks to get an appointment because she ONLY DOES 4 NEW PATIENTS A DAY.  I waited the 3 weeks for what I was told was a 7:45 am appt.  I got to her office at 7:45 (actually 7:47 am according to my cell phone).  The door was locked and the office hours posted were 8:00- to 5:00.  I could see through the glass doors that there wasn't anyone at the desk area.  l left ,went home and called a 8 am, no answer.  Called again at 8:10 and the lady said I missed my appointment and could not be seen today.  She argued that the door is always open at 7:45.  She was unapologetic and offered me a next day appointment, like she was doing me a favor since I \"MISSED\" my appointment.  She kept calling me \"my dear\" as if I was incapable of knowing the appointment time.  I found her very condescending.  Needless to say, I will not be going to Dr. Novak and will let my friends know the office procedures there and the unbendable and arrogant rules!","useful":0,"user_id":"N4t_Q1421ua-zWlQ7zhA-w"}
{"business_id":"Kz4WS00PcqOJgxfZawk4dQ","cool":1,"date":"2013-12-07 01:41:25","funny":0,"review_id":"NFlW7_5bOPkR2Nz8t9d2Sw","stars":4.0,"text":"I love Pizza, but I try to stay away for dietary reasons. I went here last week with my daughter and mom, and was pleasantly surprised. Thin crust New York style pizza at a good price. The menu is kind of simple, but that's the way these places are nowadays. Friendly staff and clean simple surroundings.","useful":0,"user_id":"qkQ5iVnEdqSxjd3faoRTpw"}
{"business_id":"nsNONDHbV7Vudqh21uicqw","cool":0,"date":"2017-05-26 02:22:41","funny":0,"review_id":"eKgibXL3A2DeRkQjF5BQDA","stars":1.0,"text":"Was very excited for happy hour and heard great things. Food was less then average we were charged $10 for BREAD.  Most apps were greasy or fried and still spent $250 on happy hour menu for a group of 4. First review on yelp so cared enough to take the time to write this. Sorry won't come back.","useful":0,"user_id":"iFnEh9lsL2CIFnddSaEHAw"}
{"business_id":"r395lMbm1ihAQ2sMOcFKow","cool":0,"date":"2015-06-21 01:52:23","funny":0,"review_id":"ZHr51YsCl76MwX6NrgGiTw","stars":5.0,"text":"Excellent shortbread.  Koodos to Ms. Mary and her oh so good chocolate crunch shortbread cookies.","useful":0,"user_id":"nNVznu_dQsn43SrakB4Ldw"}
{"business_id":"9nHpqlu7be1466wdo_t5kQ","cool":0,"date":"2018-03-15 20:12:39","funny":0,"review_id":"niN5qW_M5Y0W0zQEcQcFig","stars":2.0,"text":"My family and I came in on Wed. Night for dinner we had a party of 6 plus a baby(using a high chair). We had to wait about 10 mins to be seated and when we got to our table it was against the wall, half booth half chairs. My husband asked to sit at another table but the hostess said \"No\" so we had the baby between our table and the customers next to us, luckily she's a great baby!! The table and booth were dirty and floor was sticky, gross, and I had to kick a fork out from under my seat. The service was subpar but the waiter was nice. It took 20 mins for my boys to get their drinks and refills, well they were sparse to say the least. I ordered steamed broccoli which was actually raw when it came out the first time but they, what I believe, microwaved it to warm it up. My poor daughter in law had a charcoal patty which she sent back and it took a good 25-30 mins to be replaced.\nThe worse part is my son has a sensitivity to gluten so he ordered a gluten free bun but they gave him a Ciabatta bun which he didn't realize until he had already eaten half the burger. My husband brought the issues up to the manager but she didn't really contribute anything to the situation other than sending the burnt burger back. The waiter's solution for the inconvenience was a free appetizer card to be redeemed the next time they came in. We live 3 1/2 hours from Mesa and it's so disappointing to run into this kind of service, this was definitely not a pleasant experience","useful":0,"user_id":"n5E4KzRRGosdxNcdyyZztg"}
{"business_id":"gOOfBSBZlffCkQ7dr7cpdw","cool":0,"date":"2018-04-27 18:59:14","funny":0,"review_id":"EedJ77WTwkytYhAR-PVMKQ","stars":5.0,"text":"Five stars! I highly recommend this place if you're in the mood for authentic Latin American cuisine. Coming from someone raised in Latin America, I'm usually skeptical of restaurants that claim to have Latin American food because although the dishes try to imitate Latin American styles, they usually come up short and completely miss the subtle flavors that make these dishes what they're supposed to be. However, Chica completely nailed it. The whole chicken with chimichurri is a must-have (we shared it among four people) and the small dishes were delicious as well. The mini arepas that came with the guacamole were a really nice surprise and the empanadas were simply amazing and tasted just like the ones back home. Besides that, the latin music was on point and the cocktails were great too!","useful":0,"user_id":"piYjHlLZQCtg9Q1QT0Lvbw"}
{"business_id":"lVfZ2AaYRYHCFenUMQna8g","cool":0,"date":"2015-10-07 20:52:28","funny":2,"review_id":"kN7QMpXNT38NeeesQ6zYUQ","stars":5.0,"text":"Oooh momma!\nThe flavor is strong with this one.\nClean, fast, friendly everytime. But not weird and sterile like Baja Fresh.\nGlad they're open again!","useful":0,"user_id":"U6tZwpRVjUfx-fwDbMAlPA"}
{"business_id":"7gquCdaFoHZCcLYDttpHtw","cool":0,"date":"2018-04-27 18:59:27","funny":0,"review_id":"fLpptx23TFQODCEPocAQ0w","stars":5.0,"text":"LK is a great technician! He makes you feel relaxed and comfortable, as well as being extremely attentive to your nails.","useful":0,"user_id":"gGWKLhE9-F6g9kd66nOUxA"}
{"business_id":"Vs7gc9EE3k9wARuUcN9piA","cool":0,"date":"2015-12-05 04:03:23","funny":0,"review_id":"ga8yPF_gxHby3DYe5uwO5A","stars":5.0,"text":"Oh. My. Gosh. I'm not going to write much except that it was DELICIOUS. I came here because of all the reviews and seriously it was worth the drive. I had the spring rolls and those were delicious. Then I had the noodle ye-saw with shrimp. And I pretty much licked my plate. And all the plates going by looked better and better. I'm already planning the next time I come here. And my server was a sweet sweet girl. Soft spoken but just the perfect server. I'd take a picture of my food but I dove in and cleaned my plate. Lol. Oh well. There are 254 pics for you to choose from.","useful":1,"user_id":"zepXHHsm5d4vt4JT11koQA"}
{"business_id":"luPvNx4XSxaM7pka8EifuA","cool":2,"date":"2017-04-19 11:38:43","funny":1,"review_id":"nx3RLktQxXT6ACp5M3OJwA","stars":3.0,"text":"Fresh food, tasty, and amazing service are the 3 characteristics that come to my mind when thinking about this place. However price is a big downside.\nWent there on a Tuesday night, did not have to wait for a table and service was quick and the staff was very friendly. The menu options are pretty limited but definitely focused on providing the most typical Portuguese experience. \nOne major downside: the food portions are extremely small for the price you pay. The value for money clearly isn't fair considering they are dishes tapas style. In a regular restaurant you'd get real size dishes for the price you pay for tapas there. \n2 mini starters, 2 entrees (tapas style) shared + 1 desert with one glass of wine gave us a $90 bill and we left without feeling full. The desert was a caramel fondant with pear ice cream, probably the only thing we ate that was so incredible we would have paid twice the price for. Otherwise it was too pricy.\nI will definitely go back once they revise their price!","useful":0,"user_id":"1DhKvepHRNKs3aUw6NSOKg"}
{"business_id":"mffVbMp5v7S6r9Xp5a1JJQ","cool":0,"date":"2016-09-30 20:16:16","funny":0,"review_id":"BEtPgLx4Abz_8fkNLY2WVQ","stars":5.0,"text":"Amazing!!! Clean and pretty! Best service I've been in Las Vegas! Everyone are so nice! And all the design are perfect","useful":0,"user_id":"yKYpt0bcSVD5W4FoPCY5iQ"}
{"business_id":"qsJkjQoM3Hdg6Gtqp2S9_w","cool":0,"date":"2014-08-24 20:46:44","funny":0,"review_id":"AiMNpJ6dRLBT6jQ3R3fWFg","stars":4.0,"text":"Amazing place, full of authentic decor and ambiance! Papaya salad is so refreshing and full of flavor. Combination pad thai with pork beef and shrimp is enough for two meals.  Thai toasts for an appetizer consists if minced chicken and shrimp baked on toast served with cucumber salad. It us a must try!!","useful":0,"user_id":"th7tfMsh74S6sa_BWOt8YA"}
{"business_id":"0xyqLvtr0Zbr4G-gML-QmQ","cool":0,"date":"2015-05-26 06:43:03","funny":0,"review_id":"kz-EVInXbGuDwglTZhig3w","stars":3.0,"text":"I'm not that pleased with this experience. For the price, I expected better ambiance and better presentation. The steaks were seasoned and cooked well. Our family enjoys a good cut that's perfectly done to each person's speculations. Also the service was perfect. Our server was thoughtful and attentive, without overly interrupting when we didn't need anything. However, for the high price of everything (not just the steaks) on the menu, we would've expected the place to feel more exclusive, more fancy, not so loud. It felt like a nice bar rather than a fine dining establishment. We had to shout over the noise and the place wasn't even totally full (Sunday evening). The plates were also nothing special to look at. Again because of the price, we expected a few frills. The meat and separate sides came out just plainly put onto plates. No effort was put into the presentation. Even casual restaurants throw some greens or garnishes on the dish for a little extra aesthetic. Probably won't return. If I'm paying this much, I'd like to feel a little more pampered.","useful":0,"user_id":"XQDfhRd54J7OgimNNxdAcg"}
{"business_id":"da_QOspls2XoU5AZ6QNcww","cool":0,"date":"2018-02-01 18:58:45","funny":0,"review_id":"1s45p14oMTa9F1qEFmQycA","stars":5.0,"text":"I work at Wells Fargo right next door to rubio's on 24th st and baseline and out main goal is too satisfy the customers using our vision and values. That being said rubios is so relative because everyday I go to rubios for lunch they make me feel at home and like a valued customer by showing quality service and going over and beyond the standard for me! They don't sale chimichangas but the manager George and the great cooks took it upon themselves to fry my burrito for me! George is a great leader and represents that franchise at a high level! Last but not least Priscilla the shift leader, lights up the whole room with her smile as soon as you are opening the door, as well delivering excellent service! Thanks rubios - DA'QUON  #YOURBANKTELLER","useful":0,"user_id":"q37OXosU0FHD6aPEec1LQg"}
{"business_id":"UowplTMikVmB91hiQ_GaaA","cool":0,"date":"2011-10-27 17:46:09","funny":0,"review_id":"zwLqb33deJR769W9fX__MQ","stars":4.0,"text":"Wiki Wiki is like the middle ground from your typical gas station auto wash and full service washes with the personal touch.\n\nYou start out by ordering your service at one of 3 electronic kiosks.  Everything is touch screen. They give you 4 choices but then they suggest additional upgrades to your wash.  You pay and then move on to the wash.  Someone assists you in getting your car lined up in the track.  Put your car in neutral and in a few minutes your car moves through the wash and you come out the other end.  \n\nWhen you come out, you have the option of using one of several free vacuum which are powerful.\n\nThis is a great alternative to the full service places.  It's quicker and you don't have to wait for someone to towel dry your car.","useful":2,"user_id":"SlgpAnj2gQd44EM_Uq6DkQ"}
{"business_id":"dLxT3-EwXkrI9AXoW6HCGg","cool":0,"date":"2016-01-30 01:29:21","funny":0,"review_id":"LqShY--VVp_0lkgauFcx9Q","stars":1.0,"text":"PLEASE. Read this before you buy a session with her. About a year ago I bought a groupon here and having a horrible experience I've never used groupon for services again.\n\nYou get what you pay for - and in this case, less. Lesson learned.\n\nShe uses clumps of lashes that fall off within 12 hours. Your eyes will also be completely bloodshot from whatever glue she uses. I let her know and even sent pictures of my eyes because they were so red and painful I thought they were infected. She blamed it on me and offered to \"fix\" them for more money. I declined - there was no way I was letting her do any more damage. I have had my lashes done before and since with professionals and have never had that happen. I love the lash service at wishful winking and the spot in Liberty village. \n\nIcing on the badlashes cake: she was over an hour and a half late for my apt and claimed it was never booked. even when I showed her the text she had sent me with the confirmation.  The whole time I was waiting my gut was yelling NO and I should have listened.\n\nJust no.","useful":10,"user_id":"scitRtsLa4QP9S1LZUIVWQ"}
{"business_id":"Z6l0-bY6TklTdr_X88LFVQ","cool":0,"date":"2018-10-04 14:49:56","funny":0,"review_id":"GOn4Ggzjsb5d9b5t8K5c1Q","stars":5.0,"text":"We used Creative Bridal for our Vegas wedding at MGM Grand as part of our wedding package. Originally it was only to get my husband tuxedo for the wedding. Unfortunately, my wedding dress from David's had an alteration issue and the back of my dress ripped when I was finally trying it on for the last time the day before the wedding. Since we were on our way to get a tux fitting for my husband he thought it would be best to ask them if they can help us fix it because I was in tears since the dress was ripped so bad that my butt was hanging out. Britney picked us up at MGM and brought us and during conversation she did say let's look at the dress and see what can be done. Kelly and Brittany did just that, they quickly placed me in my dress while Taisha took my husband in to get his tux fitted. All while making sure he didn't see me. I'm so grateful for all three ladies! I highly recommend them! (Sorry if I got anyone names wrong)","useful":0,"user_id":"vmz62dtSK5ZI42DscYzX8Q"}
{"business_id":"FStFa2esHFgsAjVzIGJcQA","cool":0,"date":"2014-01-17 00:23:28","funny":0,"review_id":"oMRfgrni0xBWo5zKaoxD4w","stars":2.0,"text":"Well they definitely lost me as a customer! RC Willey here I come!\n\nMy father, who is 69 years old, moved out here from Los Angeles the beginning of this month to be closer to me and my kids. I ordered and fully paid for a bedroom set for him. They called me like 4 days before the order was to be delivered to confirm the appointment. I advised the lady that no one was living in my father's apartment yet but if they could call me as they are on their way I could rush down to the place and open the door for them. I mean I live in the same complex so it wouldn't be a long wait! She said she would let the guys know but no promise...okaaaaay? I paid $1,200 for furniture, I am a repeat customer, and you can't make one quick easy courtesy call? Well I missed their delivery and no call was made. I found out from my LANDLORD that they came because they went to the office and he was going to let them in but they said no because someone had to sign the paper. To top it off, when I got my dad's key to check the place out before he arrived, there was a note on the COUNTER that said \"Sorry we Missed you\"....so they entered the apartment and left the note but couldn't put the damn furniture together?? They denied going in but how the hell did the paper get on the counter? Anyway my dad arrived with NO furniture and we had to pay $50.00 for them to deliver the furniture again 3 DAYS LATER. My father has bad arthritis and basically no cartilage in his knees making it very hard for him to get up from low areas such as couches and FLOORS which he almost had to sleep on if it weren't for my friend who let us borrow her air mattress luckily. He still couldn't get up though and crawled to get around his place until I was able to get to his place after work :(. Bottom line, they are not for their customers at all and their attitude after you purchase their crap shows it all. I will never be back.","useful":4,"user_id":"CfGtdsu0Npd1Zjx43rXIqQ"}
{"business_id":"zIjXNOEPub7T-NwQWPREMA","cool":0,"date":"2016-01-04 03:58:19","funny":0,"review_id":"pvbP7zf1fWOGqtPLx98b9A","stars":2.0,"text":"I have been getting monthly massages here for the past five months. A couple of the therapists are good, and some lack experience. As a stocking stuffer for my husband, I scheduled an appointment for him to meet with Roberta, a very capable therapist. When he arrived for his appointment, his name did not show on the schedule. Yet the gentleman working the front desk clearly remembered scheduling that appointment with me. He blamed it on glitchy new scheduling software. I was extremely disappointed and embarrassed, since it was a gift. But what else could we do but reschedule? An appointment was set, again with Roberta, through the same desk attendant, for this afternoon. When my husband arrived this afternoon, he was placed with a different therapist, who confessed that she did not know how to work with his specific shoulder issue. So he again rescheduled. This is getting ridiculous, and I'm considering canceling my membership over it.","useful":4,"user_id":"-87w4IWK4a1YO8pL2Xfsew"}
{"business_id":"seYvTmOZGJ2IAMdfQa8pkg","cool":1,"date":"2014-02-24 00:11:38","funny":0,"review_id":"qdfEZn3ObIEHC-tiX1aduw","stars":3.0,"text":"I've been here 2x wasn't impressed the first time figured give them a second try. There latte doesn't impress me I'd rather goto the Starbucks adjacent to this spot","useful":1,"user_id":"ri7itn7-CdpsaPxTToK5cQ"}
{"business_id":"i2qKNktpvKOWrREXvMoyKQ","cool":1,"date":"2013-01-27 18:34:29","funny":0,"review_id":"BRNHu0kBhbiTMXhbERNw6A","stars":4.0,"text":"A toned down version of the king street location, GotStyle is a great store primarily for the service you receive.\n\nIt's definitely not for everyone - there is a price tag attached. But if you shop at places like Holt Renfrew or even the Bay then this place is considerably better in my opinion.  The reason - the sales agents are just better. They have pretty good sales twice a year, which is when I tend to go but sizing is obviously an issue at those times. I appreciate that they carry various price points in the mid to high range.  \n\nOverall, I wouldn't get my formal wear from here. That's just me personally. I'd rather go to the U.S. and pay half the price for the same quality. But if you can't do that, they have an excellent selection and great tailors. You can find cheaper tailors in Toronto, but at least at GotStyle you don't have to go through the hassle of finding the right tailer. You can trust the store. \n\nThey have an excellent selection of casual clothing and interesting and cool clothing pieces too. \nThis is definitely a go to place if you're anything like me and don't know how to buy jeans. My last visit at the store, Jannette spent a great deal of time educating my friend and I on how to dress. We left the store uncharacteristically self aware of ourselves, but really, we learnt a great deal in the process.","useful":0,"user_id":"yT_QCcnq-QGipWWuzIpvtw"}
{"business_id":"LW21U6m6axC2lCLYc0fFSA","cool":0,"date":"2011-02-13 17:18:49","funny":0,"review_id":"DnjyWYnv95PjPx5tazakEg","stars":4.0,"text":"Their red velvet cupcakes are AMAZING! Their buttercream frosting is fantastic and I also like their brownies when they have them. The location couldn't be better. I'd say you couldn't find a more romantic date-spot. I won't give them 5 stars though, since I have had some dry cupcakes in the past and they seem to always run out of the good stuff (mostly the red velvet) on weekends which is the only time I can make it over there.","useful":0,"user_id":"dhUOHemaqOFWLC-mmLXAaw"}
{"business_id":"tqN30ZVHlmxbI-uQ4ORyjA","cool":9,"date":"2016-04-11 17:11:35","funny":6,"review_id":"jQxm5RANNaqF6AV7lnIU0A","stars":5.0,"text":"I so disagree with a couple of the reviews I read. Dr Miller is one of the best doctors I've ever seen and I've seen and worked with many as a medical professional. She is very detailed and shows concern regarding all aspects of my health. I have referred several people to her.   Highly recommended!!!","useful":11,"user_id":"wzuxPP-d18Mu_IooKVZy-w"}
{"business_id":"SZQINqa278e7DEM_B3WK8A","cool":0,"date":"2016-01-30 00:53:48","funny":0,"review_id":"ttW64so8qUD_WR4ZLVbzPw","stars":1.0,"text":"My experience went from bad to worse.  This place is filthy and the employees are extremely rude. I pawned an item and when I went back to pick it up the place we closed.  I went back first thing in the morning to pick up the item. I was told that the finance charge was double for being a day late.","useful":0,"user_id":"VibuEzhWblm9x9t0_YhPRQ"}
{"business_id":"TVLAvAFx0FqAkKGKHVjHpQ","cool":1,"date":"2017-12-15 22:49:01","funny":0,"review_id":"6JgzKIDvophsU1yfK0DdyA","stars":4.0,"text":"I love this place. Lots of great, healthy options. Excellent variety, friendly staff, no exorbitant prices. Doesn't beat being held by someone who cares about you, but what does? Enough melancholy from me...go forth and eat healthy","useful":1,"user_id":"mZ1gXzL6Tn5Oky8_j0Kp7g"}
{"business_id":"81H_yEsSDHcy2rXZ7EwsZw","cool":1,"date":"2017-10-02 01:55:33","funny":1,"review_id":"Ek5U7NFE28yFiQ_KkfXw1Q","stars":5.0,"text":"I've received great service and highly recommend Stone Law. I've been a client for many years and can attest they do great work!","useful":1,"user_id":"wWvsI_LT3c1CuyUrlX-SBg"}
{"business_id":"q8MUVVuQpfR6v0HBHmAFxw","cool":0,"date":"2013-12-28 23:36:44","funny":0,"review_id":"_lGsXGF_nnKzmwl0I_A9tA","stars":4.0,"text":"They specialize in Southern California-style food like burritos, salsas and fish tacos. The decor and ambiance is great. The tables and bar stools, exposed-brick wall, modern light fixtures etc. make for a classy and comfortable dining experience. I saw a few craft beers and a respectable bourbon list. However, we did an early Saturday morning breakfast, which was fantastic. The banana pancakes were unreal.","useful":0,"user_id":"iJCtRAlSvxiUuKlVAnsq0A"}
{"business_id":"1-mycIcKFGbvqLE60XrwnQ","cool":0,"date":"2014-02-05 19:00:13","funny":0,"review_id":"ImAnCO3PJXW9fhh7yEazrw","stars":3.0,"text":"I normally stop here for breakfast when travelling through calgary international airport.\nIt is one of the few restaurants available once you pass security.\nFare is ok for a decent breakfast and good coffee. \n15 dollars for breakfast","useful":0,"user_id":"TcByPmEbsEQYJYT7IBKXdg"}
{"business_id":"FQDoxOKH31URBSGLTYNCXg","cool":0,"date":"2016-07-03 17:28:42","funny":0,"review_id":"J7wnH4rF4Ovnuvtf098Tng","stars":2.0,"text":"Absolute waste of money. My husband and I felt no different after using the oxygen bar, massages and drinking the $5 peppermint drink. The employee was very sweet, but don't waste your money. This place would get 1 star if the customer service sucked. And they tell you it's $22 for the oxygen, but they also charge $5 for the thing that goes in your nose.","useful":0,"user_id":"Gadas_vO8fqQkoTeGcBxIg"}
{"business_id":"0xyqLvtr0Zbr4G-gML-QmQ","cool":1,"date":"2011-02-13 17:02:01","funny":0,"review_id":"yjjaOFx6ojWzNQjhN9uEoQ","stars":5.0,"text":"The 5 for 6 'til 7 is so awesome and such a great deal! I wasn't sure the first time we went if we should dress up or if it was okay to wear jeans and a nice top but everyone was either in their business casual work clothes or jeans. I would recommend getting there a little early because it fills up quickly! We got there at 6pm and by 7pm it was pretty full.  I have recommended this to so many of my co-workers and friends to try out and so far anyone that has gone has come back to me saying what a great time they had and how surprised they were with the 5 for 6 'til 7 deal :)","useful":0,"user_id":"jEG_kO7nqBA97n2beBSkhg"}
{"business_id":"Z9Ss9LhBN2zVNQw9DpjVbQ","cool":0,"date":"2014-05-07 18:20:18","funny":1,"review_id":"BuZL8qQge7xEDQ8CbgfMYg","stars":5.0,"text":"It was my first time here and I was definitely\nImpressed. The groomers work and etiquette was lovely. I usually need the works when it comes to my little schweenie mix. ;) I'm glad I went to her and will most definitely be back!","useful":2,"user_id":"L4a1GIRlX2N46CPh5Zh-8Q"}
{"business_id":"MPLhOV-JbmntkbcXMyCODg","cool":0,"date":"2017-08-16 04:18:04","funny":0,"review_id":"_MQLmkkPKBo5ibPaidZZCQ","stars":2.0,"text":"The only reason I'm even giving this place 2 stars is because of their food and drinks. Their service however, is probably the WORST I've ever had. I used to (emphasis on the tense) go there every Tuesday for trivia night (the guy hosting is awesome). My service has been absolutely horrible every time except for once when a girl named Jess waited on us. The rest of the waitresses are completely incompetent and utterly rude off the bat. \n\nWhen we began ordering appetizers the waitress stopped us and asked if this was \"going to be complicated or not.\" She then forgot to put in an order for 1 of 3 appetizers ordered. It took about 15 mins after getting 2 of them, to even bring that to her attention, for which she didn't even apologize. After 35mins and someone else bringing our food out, we finally had to go to the bar and ask someone to come take our drink orders, a task that was also messed up (I ordered their special of Big ass margeritas to which I received a small mason jar of mostly ice). They told me it'd be free, but it honestly wasn't even worth that. After that, the only time I saw our waitress was when she was visibly talking about us and pointing with another waitress. Completely unprofessional. A different waitress had to bring us our checks and messed that up too. \n\nI had this same waitress the Tuesday before accompanied by the same crummy service. That's when I realized that it wasn't just a bad or busy night (it was a Tuesday for crying out loud), but that this woman is just REALLY bad at customer service. Definitely do NOT recommend going there!!! Don't know exactly which was our original waitress but our checks said Joanne G. \n\nWill also be posting my experience on your Facebook in hopes that you get better trained and caring staff.","useful":0,"user_id":"8pv8leqC1AVx1KgefjM8sw"}
{"business_id":"2bUK2xslXInox0gjapJjlQ","cool":0,"date":"2012-07-16 01:17:34","funny":0,"review_id":"erkhzYAwJ-Y4xEg_50eyTA","stars":4.0,"text":"I've been here a couple of times by recommendation from a Korean friend. The Jjamppong and Jjajangmyun are very delicious. It's even better when they're cheaper on the special menu days (rotates every other day). The portions are very generous. I usually share 1 dish with my friend. It's $5.00 (Jjajangmyun - Tues,Thurs, Sat, Sun) and $6.99 (jjamppong - mon, wed, fri).\n\nHowever, I was a bit surprised at their dish with the steamed buns (I think it's Kochu Japchae)... it was super pricey!!! That dish alone was $20.99 on the special... very little meat, mostly peppers and some other veggies. I'm guessing the expensive part was the steamed buns... 'cause those looked really intricately made.  I think there are actually several pricey dishes they serve on their menu. I'll just stick to the affordable menu items.\n\nIn general, I really like their dishes (jjamppong and jjajangmyun), and their service is friendly, but I don't think I can come here without my Korean friend. It seems like the servers don't speak English, and there is no translated menu...","useful":0,"user_id":"dAB-v4B-5_8QgTcoVSnZOw"}
{"business_id":"54C4GTsIWa4zUM0d-v72Kw","cool":1,"date":"2015-07-16 06:18:20","funny":0,"review_id":"x5CnnzoGFXP8zE52TdZ2SQ","stars":1.0,"text":"Horrible experience I went in to get a full set french tips the guy who did them was very rude never said a word only yanked at my hand he cut my real nails after I told him not to. I complained about bubbles and dust inside the acrylic they acted like they couldn't see it. Two days later my nails are lifting and more bubbles appeared. I will never go here again and hope others don't waste their time or money at this place.","useful":1,"user_id":"hhSOzS5D2OG1wHKew2JEdw"}
{"business_id":"f9NumwFMBDn751xgFiRbNA","cool":4,"date":"2012-06-26 00:48:30","funny":2,"review_id":"YkpjR5N5TLkwHi20IZ15zg","stars":4.0,"text":"Driving more than an half-hour to get to a gun range was getting old. I was so happy to see this range open up in Cornelius. They have all the amenities that you would expect a range to have for modern shooters. I come here for recreational purposes and have found the range more than suitable. They have fully electronic systems and the lanes are wide and not tight like many other ranges. They also offer memberships that are competitive to some of the other ranges around the area. Daily lane rates are a bit pricy, but considering their location they can charge that much. \n\nHowever, stray away from the touristic prices for weapons and ammo. There are many other stores that just sell and you'll want to visit those. The prices they quoted me were $200 more than several other stores and I just couldn't bite that bullet. \n\nCome here for the range and range only.","useful":23,"user_id":"xDtS2iKsJuVUVzB2YhfPsg"}
{"business_id":"CtYWpX_cy1YdZgoKtS0Tqg","cool":0,"date":"2015-03-04 19:46:32","funny":0,"review_id":"ydehlths0Zpg2gbXPOs6Qw","stars":1.0,"text":"Also don't believe when they say they will give you a credit for unsatisfactory meal because for some reason they have a tendency to forget they said it.  They no longer have to worry about my business.","useful":1,"user_id":"wUAQq8gZ9tpWpMDPNTB6TA"}
{"business_id":"Z66xO_B7trDah8F0PKwRqg","cool":0,"date":"2018-05-28 20:32:27","funny":0,"review_id":"Pin7lN2A9XzBVpzgq4-wgQ","stars":4.0,"text":"We stopped by for a little shopping. The mall is nicer than most and has plenty of stores. It was a nice way to spend a few hours before heading on to another adventure.","useful":1,"user_id":"EYnRRWIOlxKcylR457hSMg"}
{"business_id":"VVdbPZs0M6d_X5XdgyAhig","cool":0,"date":"2017-01-14 20:34:44","funny":1,"review_id":"sPSB3fJKruTUXDec6YRUHw","stars":1.0,"text":"I hope that every person who follows me, everyone I know and anyone contemplating this establishment reads this first and NEVER bothers to give this place with the crappiest staff of all time a second thought. Earlier today my friend and I dropped in to grab some lunch.. the staff either all lost their dogs this morning, or just have the absolute worst attitudes you've ever seen in human beings. Not only was the nasty woman who served me avoiding any type of pleasantry but she was yelling across two other workers and a line of patrons asking what I wanted from the other end of the shop. When I asked the server for lettuce, onion and roasted red peppers on my sandwich she quite literally moaned very loud and followed it with yelling \"ughhhhh god help me!\" Before adding my toppings to my turkey sandwich. When one of the other servers asked us if our food was for \"here or to go\" the original server says aloudly \"to-go hopefully!!!\" Wtf... I'd love to know who this terrible human being thinks she is! I found my jaw on the floor more than once, wondered why she thought I was such a headache, and my friend and I decided right there that we would NEVER return nor would we let this review go untold to everyone we know!! I feel the owners somehow have to be to blame! How the hell do you allow someone so miserable represent your livelihood? You don't expect livelihood for very much longer, that's how. \nPs... maybe this server will look a little less \"I just woke up\" at her next job.","useful":5,"user_id":"XGHvw9aF-8a3rn-2Lji8nw"}
{"business_id":"br1uQbc3YU5jCpYi46nIgQ","cool":0,"date":"2018-04-04 00:09:03","funny":0,"review_id":"P4dPuD9Idbywu4431_-dMQ","stars":4.0,"text":"Cafe Maya, the newest coffee shop in this location. Not too much has changed, although the inside seems a bit more spacious and cozy. They offer all of your typical coffee drinks and prices are reasonable. They have a couch and a large chair as well as around 10 wooden tables with chairs. They offer a food menu for breakfast and lunch, but not dinner. They also have a rewards punch card for loyal customers. This place is usually pretty quiet and chill and not too busy, so a good place to go for some casual studying. There is no parking lot, so you have to hope to find a street parking spot available nearby which is the main limitation if you are driving. Overall a nice little coffee shop.","useful":0,"user_id":"MB7Z80PJxNyQM7keDpR2XQ"}
{"business_id":"0JGMKaKJGVuDus5WcJzvjw","cool":0,"date":"2017-04-30 03:37:51","funny":1,"review_id":"oDxnoU49up9-wTnJ7RttBQ","stars":5.0,"text":"Unbelievable experience start to finish.\n\nWe had a reservation for 9pm Saturday. When we arrived our table wasn't ready yet but the host asked if we wanted drinks and took our drink orders. There is no drink menu here - the staff is the drink menu- which was nice. Everyone is very knowledgeable and quick with recommendations.\n\nOur party was big so we were seated outside on the patio which was enclosed and heated.\n\nThe menu changes a lot apparently and there is also a pretty big specials menu. For apps we got oysters, a sea urchin (from the specials menu), the foie gras terrine (from the specials menu), and the veal tartare. Everything was incredible and pairings were perfect. For example the bread that came with the foie gras was completely different than the toast served with the veal tartare which was completely different than the bread we were served with butter and pickles while we were waiting for our starters.\n\nFor dinner everyone got the lobster spaghetti. The portion was way big enough for two after apps and it was incredibly rich between the sauce, bacon and huge lobster chunks. Each order of the pasta comes with half a lobster.\n\nEvery wine pairing we tried was amazing.\n\nUnfortunately we had no room for dessert but the meal was definitely above out expectations. \n\nExpect to be here for a while. Our reservation was at 9 and we only finished eating at 11:37- and we're not slow eaters. I think the wait had to do with our party being big and the rest of the place being packed","useful":2,"user_id":"8DOKugzD27-gGooC1vp4bQ"}
{"business_id":"UJb1PrUWDFfuzwUPc1pP4Q","cool":0,"date":"2014-06-27 21:15:37","funny":0,"review_id":"IQ6yUAb-sCu4iQ5MMjDCHA","stars":5.0,"text":"Wild every night! My favorite place hands-down in AZ! The night life here is contagious and Iv never been disappointed with there Sunday fun day! Every Sunday they have a corn hole competition and crazy drink specials like penny refills!! You also have to try there duck and pork tacos or there Hefe Hamburger! My favorite margarita on the menu is the la chica flaca. If you want a fun place to get lunch and a few drinks or looking to go crazy night this is the spot.","useful":1,"user_id":"-RKsh-eKWJtDqnzTLCz-1Q"}
{"business_id":"m-cg3stOStMAFEV9-8qnVw","cool":0,"date":"2012-06-26 00:17:23","funny":0,"review_id":"J0VOXqlJ21O5wMJgV8VuEw","stars":3.0,"text":"The reason that I'm giving Scallywags 3 stars isn't for the food, it's for the fact that this is what it is: A drinking hole that shows the games on the telly & not for a meal. \n\nWe went to see England play in the Euro 2012 and it was fun! Everyone was totally into it. \n\n**this place is to have a beer & watch the game not for eating**","useful":2,"user_id":"uLQJAaULt91a263PsRyEqQ"}
{"business_id":"faPVqws-x-5k2CQKDNtHxw","cool":0,"date":"2018-08-04 20:22:15","funny":0,"review_id":"w1I8U4cJ4QGaXA98ImNrbA","stars":5.0,"text":"Service was amazing, Christina was extremely tentative and took care of our whole group. Asked about splitting checks from the beginning which for a large group is very convenient!","useful":0,"user_id":"rJNdeta-dYO2YcJ3u5JxnA"}
{"business_id":"LWxSTjV6zybxIZKkSK3SNQ","cool":2,"date":"2010-01-08 07:40:38","funny":1,"review_id":"YzZXhNvtIVeVTjhOgHCvcw","stars":4.0,"text":"Right off the bat, I need to tell you that I love thrift store shopping. Adore it. occasionally have sultry dreams about it. Okay, we'll stop there. \n\nSavers is the heaven and hell of Las Vegas thrift stores. You have to be willing to get dirty, to get on your knees and repent. You have to suffer through repeated disapointments in order to achieve the nirvana of a true thrift store find. \nFirst trip out - chewed up Barbie dolls and incomplete board games. Second trip - A set of Christmas lights marked for $2 more than at the Walmart they same from. But then, on the third trip back, there it is - the chimera. The unicorn. The 36\" 1970's black velvet painting of two tigers in flagrante delicto. The Elvis cookie jar. The wine cooler made out of an abandoned suit of armor. The red leather Michael Jackson Thriller jacket. A bronze toreador sculpture. And it's only $12.99. \nAh- Thrift-gasm. Thank you Savers. I'll see you next week.","useful":2,"user_id":"YGA0_s3O93ORmM_E8BpQDA"}
{"business_id":"Nc7cqq5k0WZsVhu25QrmNQ","cool":0,"date":"2015-01-03 22:46:37","funny":0,"review_id":"485juGN7xennwKdLzToQrw","stars":5.0,"text":"The gang at Sun Valley Stereo is definitely top notch. Ryan gets right to the point and saw what I was interested in, and we worked together to verify that all the parts were in to upgrade my 2004 RX-8 with a Pioneer 4000NEX touchscreen and back-up camera before I drove 90 minutes for the work. When I first left there was some adjustments needed. They took me back in without hesitation and made everything right. The installer was committed to treating my car like it was his own. He took the extra steps to make it all right, and even fixed the hatch door to my 12-volt socket. Now that's going the extra mile! 6-stars!","useful":0,"user_id":"DtuFzGEwdYI5E3vTOMSOsw"}
{"business_id":"221yaXPE1zmJqDvBVM__tw","cool":2,"date":"2018-08-14 04:06:17","funny":1,"review_id":"At6VxX3qcfodexuXujsyjw","stars":4.0,"text":"My family and I have been visiting this location since it opened. Can't really remember the year now. \n\nAlthough several of the reviews have to do with bad customer service, I have found that it's definitely a staff turnaround issue. We go often during the summers, and well, all year round actually. LoL. It's never too cold to get ice cream in AZ, am I RIGHT?????\n\nAnywho, the ice cream is always yummy and the experience of the kids being able to run back and forth AND BACK AND FORTH trying new flavors or deciding which one to pick It's always fun!  \n\nSadly, the smiling faces might not always be there, but thankfully, we always have a smile on OUR FACE that transfers to them weather the staff likes it or not. LoL","useful":2,"user_id":"jD9S1crLvnAxzYEG_r_NOA"}
{"business_id":"Jbl81Qdq_tEJhKQ946Mswg","cool":0,"date":"2014-11-29 23:49:10","funny":0,"review_id":"s6d54qGQsVQVZ1Dpbez7TQ","stars":5.0,"text":"I have been there for 5 different tattoos now and could not be happier with the work done. My artist has been Eric R. and he has always done an incredible job. His attention to detail is second to none. I have recommended to friends who have been incredibly pleased with the work done. All the artists there are friendly and make the experience that much better. 5 stars and then some. Highly recommend to anyone!","useful":1,"user_id":"rP5-FenbfFzqRg0Gy3E3uw"}
{"business_id":"OJ6zfenoK-eBNI7vvNrOsg","cool":1,"date":"2016-07-03 17:00:03","funny":0,"review_id":"ewmaCrLXQW7mg1Z4gAtgZg","stars":3.0,"text":"You take the good, you take the bad, you take them both and there you have the facts of life... at Fieramosca.  (You are old like me if you know that theme song!)\n\nHave you ever gone to a restaurant with great expectations based on reviews and left disappointed?  That was our experience.\n\nSome call it cozy but for me the table layout in the main dining room is claustrophobically cramped.  If you want a seat on the patio on Friday or Saturday in the summer, make sure to reserve several days in advance.\n\nReservations are taken by phone and I will admit they were very helpful even if it did take 10 rings for them to answer... I was surprised that a restaurant in this price range did not have online reservations!\n\nBeing in a house transformed into a restaurant, the entry hallway is narrow, so if someone is going out, nobody can go in and vice versa.  \n\nSo if you are even a little claustrophobic,  be warned, you won't be comfortable here.  \n\nThe food:\n\nComplimentary bruschetta:  A plain Pizza crust with bruschetta topping which falls off and wasn't that flavourful. Go to La Bruschetta to find out how it is meant to taste.\n\nCaesar salad:  Crispy romaine, hints of fresh garlic and Parmesan but the dressing seemed watery and the croutons were like rocks.\n\nBread basket:  Now I know why the croutons are like rocks, the crust on the bread was so hard I was worried I would break a tooth, and I also found it strange to be served whole wheat bread, when I was expecting crusty Italian bread.  \n\nSpaghetti Carbonara:   The reason we came was because Hubby was craving Carbonara and based on great reviews we thought we would try it here but he found Fieramosca's version disappointingly bland, even with extra Parmesan cheese and fresh ground pepper.  \n\nLinguini DI Mamma Ninetta:  I love mushrooms but was surprised that there were so many in this dish... With just 3 small shrimp and a few small pieces of chicken scattered throughout, and very little garlic flavour, this dish was edible but far from great.\n\nTiramisu:  No coffee flavour!  I have made Tiramisu before and have had it in countless restaurants and I know the lady fingers are to be dipped in coffee before being covered in cream, and these missed the coffee altogether, and the cream here seemed to just be whipped cream, none of the yummy marscapone that I was expecting.   Libretto's Tiramisu in a jar might not be traditional in presentation but has all the flavour that Fieramosca's lacked.  My favourite dessert when done well, I left disappointed.\n\nLemon Sorbet:  Frozen sorbet in a scooped out lemon, menu says imported from Italy.  I actually liked it better than the sad face Tiramisu so hubby swapped with me because while he usually loves anything lemon, he found an odd aftertaste.  I joked it was the jet fumes to bring frozen sorbet from Italy but the truth is, it was the perfume worn by the woman at the table next to ours.  Thankfully she arrived as we had dessert, so our entire meal was not ruined, but the smell was so overpowering that it gave us both a headache and we wanted to get out of there fast, since with the cramped layout she was almost on top of our table.\n\nLadies, please don't drown yourself in perfume and go to a restaurant!  Ugh!\n\nTL;DR - Meh. Bottom line nothing was horrible but nothing was great, which for the price was disappointing.  Not worth a second visit.\n\n2 stars bumped to 3 because the service was good.\n\nThe search for Pasta Carbonara continues... maybe a trip to NYC or even Rome!","useful":2,"user_id":"zCnJQKvZgET4llBbJD1aiw"}
{"business_id":"vGDhK2Lc4Np5iZYZ7FG0QA","cool":1,"date":"2016-12-19 15:29:49","funny":1,"review_id":"e57Ecf1NsH7bVHr47ZnvSw","stars":5.0,"text":"Please try this place. The food is incredible and you can tell the people that run it are super-appreciative of everyone that comes through the door. They are very proud of their food and they make sure to tell you it's all made in house - i.e. no cans of anything. The lady that served us must have significant influence on the food as she told me she is from Mexico City so a lot of the food made is from the city's influence. I told her I was visiting MC in January and she encouraged me to try some enchiladas down there to prove the similarities.\n\nThe enchiladas I had were unlike any I've ever had. Perhaps this is how they are supposed to be? The chicken was not wrapped in a tortilla. The two tortillas were sauted in green chiles, folded over and laid at the bottom of the dish. It was then topped with lettuce, chicken, crema and all the other good stuff. It was the best I've ever had. I mean it.\n\nWarning: When the dish indicates it's spicy, it's spicy. Those were the spiciest enchiladas I've ever had, but I appreciate the spice. My gf, however, was fortunate in her decision to get the carnitas because she would have not been able to handle the enchiladas. \n\nBy the way, the carnitas were excellent, as well.\n\nThis place gets five stars and I can't wait to go back. Please, please try this place. It was empty when I walked in and that's a shame. They should have a lot more business if it was all based on the quality of their food and service. It's also very affordable. Chicken enchiladas were $9 and the carnitas were somewhere around there (maybe $12).","useful":1,"user_id":"6WYPtBdVh8Iwt96RBGpmSg"}
{"business_id":"SAfuIUZMXrOnb3LWyvYjDA","cool":0,"date":"2015-10-23 09:26:14","funny":0,"review_id":"Zs8XxGLn1z7R2bae9MBOpA","stars":4.0,"text":"Great environment, I loved their meat jun. Very flavorful. Also they give side dishes which is definitely a bonus","useful":0,"user_id":"24a7xwHNCR2t0ZDl80-DaA"}
{"business_id":"EtLM-iRYp3UGOEz4_b0I2Q","cool":0,"date":"2018-02-01 19:30:58","funny":0,"review_id":"QLi4bVBCkZ9jyJoVMFBduA","stars":1.0,"text":"What a mess. Been in line over an hour and there are still about 10 people in front of me. Should've stuck with the company I usually use....next counter or two over. Came here based on SW Airlines suggestion and email. Ugh","useful":1,"user_id":"MGkkr8cZJDHThfsd8dhv1g"}
{"business_id":"SVGApDPNdpFlEjwRQThCxA","cool":0,"date":"2014-10-11 08:23:56","funny":0,"review_id":"LQ4seKEnmMK5PYKtFcaT3A","stars":5.0,"text":"I don't normally say things are the best but these are the best fajitas I've ever had. Chips are perfect ,salsa is perfect, bean dip is perfect, and the best fried ice cream I've ever had. Plus the service is great.","useful":0,"user_id":"9SqPSd2HnDJIM3v4_j9LYA"}
{"business_id":"8WBHKj2davW6hhZWlUQ7DA","cool":1,"date":"2016-02-11 23:45:29","funny":0,"review_id":"gQl8mh2FlksNO3_An2IRxQ","stars":5.0,"text":"Great venue. Every seat in the house is awesome. Been here twice, once for Britney and another time for Jlo. Both were fantastic performances; sexy, sultry, and high energy! Love, love them and this venue!","useful":2,"user_id":"gEIrEf488lkHwCoVOYd3vA"}
{"business_id":"MNqGE0t4hOHMl2ap1LjoKA","cool":0,"date":"2011-10-27 16:28:32","funny":0,"review_id":"MLahgLNN95BSHoeD9pBkBw","stars":1.0,"text":"I did not visit the Kent office, but the office of Dr. Brown in Fairlawn. She was lacking in compassion, clarity, kindness, and professional ethics. She judged me based on my  pharmacutical history, and did not even glance at the stack of medical records I brought with me. I have been treated by some of the best in the country at John Hopkins and Walter Reed, and to be treated so unprofessionally in this office was an insult to the profession. Do NOT waste your time with Dr. Brown!","useful":1,"user_id":"9PCKsjhp_K89PbPohODEQg"}
{"business_id":"FKQUxOfW_W5R4OTut4G1Vw","cool":2,"date":"2017-01-14 21:30:10","funny":0,"review_id":"CI-XcT2XrBpC2RHmeVGaxg","stars":4.0,"text":"Definitely a spot to check out when looking for a quality sandwich at a reasonable price.\n\nThe shop staff are very friendly and more than willing to accommodate any request. \n\nDo yourself a favor and get one of the steak sandwiches off of the menu. They are amazing. The ultra is my favorite.\n\nAlso the Cancun fries are awesome. 1 order is for sue big enough to serve 2 people maybe even 3! \n\nThis is one of the Peppis that takes credit cards as well. Not all do FYI","useful":2,"user_id":"Mrudkq5duCOoiuhL61ZBcQ"}
{"business_id":"gc_GGat7TgNCmrgc4nVOgw","cool":1,"date":"2017-03-27 01:24:15","funny":0,"review_id":"YOYd3KJp5Cslt49hhifeeg","stars":5.0,"text":"I had THE BEST VEGAN Gardein chicken plate with broccolini. I was blown away!!! The decor is cute! Nicely dimly lit, It was romantic and very chic. I recommend coming if you're a vegan looking for a good dinner!","useful":4,"user_id":"JoCFa-5YdQfc0zGGFrRNHQ"}
{"business_id":"d8lmIZIqmBC9oPM8y1dc7Q","cool":0,"date":"2011-07-28 11:30:43","funny":0,"review_id":"xLPt2YOqBTJ1fNwC3bPdOw","stars":3.0,"text":"I've dined here a few times with my family and we keep coming back, despite a few misses.  I really want to be a fan of this place though. The red salsa is good and hot while the green satisfies the less adventurous.  The guacamole (made to your specs at the table) is delicious and its pretty much all my 4 year old eats there.  I normally get the tacos, either brisket or fish and they're really great, though I'm not a fan of mango salsas in general.  \nLast night we had the guac and a couple of Wednesday special margaritas which were just right.  We thought the chips tasted a little stale though and the small bowl, coupled with distracted waitstaff, became empty quickly.\nMy wife and I split the main dish, which was a special \"baked brisket enchilada\" recommended by the waitress.  It was huge and definitely more than enough for too, but we didn't care for it. There didn't seem to be much beef in it; it was mostly sauce and cheese. \nIt will be awhile before we go again, and I think we'll stick to the tacos when we do. In summary, lots to like here, but I'd say stick to the basics.","useful":0,"user_id":"nLxx0ZC9ni7ifnjsXLonSQ"}
{"business_id":"39YKi45PetO0UcQrG8Sncw","cool":0,"date":"2015-06-21 00:22:33","funny":0,"review_id":"Ilz37LB8wVYMGXNqRDQbFg","stars":5.0,"text":"Thank you so much Tanner!  Fantastic job.  Super nice clean shop.  Respectful, professional.  Just great.  \n\nthanks again.","useful":0,"user_id":"FRZjef-q1gti4igt1LU0RA"}
{"business_id":"Yq7u6XXyDITG7I6yKAXU0g","cool":7,"date":"2017-08-16 04:52:54","funny":4,"review_id":"8ZLUN83zwoxM_SZ7NZlj2w","stars":3.0,"text":"Well this was the first time trying this place since they just opened not long ago.\nWe wanted to try something different so we ordered the half sub and soup special. I thought it was expensive if you ask me. It was like $9. So it was over $20 with 2 specials and a drink. It didn't even fill you up for that kind of money!\nThe soup comes in a small container and the sub is very small for being a half.\nVery disappointed in how much came on the sub. They make them with their back to you and you can not see the items they put on and they don't even ask what you want on it. They just proceed to make it the way they want.\nI can honestly say you get so much more for your money at Subway for much less and you can make the sub the way you want and you get very full and sometimes even have leftovers!\nThe soup was hot and had a good flavor but such a small container and they fill just above half. We didn't get much at all.\nOver all not our favorite sub place. Not happy. Not sure if we would go back here.","useful":9,"user_id":"zH6racrZ7rUqqv_Qy6dZDQ"}
{"business_id":"WKOUTdVJS58E178JjhwidQ","cool":1,"date":"2017-06-06 19:35:30","funny":0,"review_id":"JQqkuljXAr169_5Pqe-xLA","stars":4.0,"text":"I love coming to pastel ! My favorite items are the black sesame crepe and the green tea crepe. Their waffles are good too, but I personally like crepes more. The ice cream and whipped cream is not too sweet which I like. I recently tried their matcha batter crepe, it wasn't bad, but I prefer sticking to plain crepes with green tea or black sesame ice cream.\n\nI think pastel is a great dessert spot after having dinner around the area. The outdoor seating also makes it a perfect date spot in the summer.","useful":1,"user_id":"eZeBuiVZWT7u3SktO7mv9w"}
{"business_id":"9t8PEynZGVCG1EjOQr1xBA","cool":0,"date":"2015-12-20 20:21:39","funny":0,"review_id":"21XPYcGfDDOwRWZrUpJn7A","stars":5.0,"text":"Seeing \"Chicago\" in the name of a taco shop gave me a little pause, but the food and employees are both 5 stars. \n\nThe Asada fries were awesome! The meat was well seasoned and had that perfect grilled crunch that I love. You can choose nacho cheese or cheddar,  I chose the cheddar, and they put a good portion on.  It's topped with Pico,  sour cream   and a huge scoop of fresh guac. Lovely dish!\n\nI also had a pastor taco, which is just like a traditional street taco you would find elsewhere.  The pastor was perfectly seasoned and had the same crunch from being grilled. \n\nOverall a great experience: Food was great and the staff was very friendly.  The owner came to the table to  ask how the food was and we talked for a few minutes. He was genuinely interested in feedback and his passion for cooking and providing a great experience for his customers was very evident.\n\nI recommend everyone stop in and give this place a try.  It is now on my list of regular lunch spots when I am on the N. Side.","useful":2,"user_id":"SNpi9tKh2EUWdbxAELLMpA"}
{"business_id":"eS76100l3h7Ollb5s3_M4A","cool":0,"date":"2016-01-04 03:37:35","funny":0,"review_id":"VaNUI2jmyGABdjXcRwlSOA","stars":4.0,"text":"What a cute place! I was visiting relatives in the area and we went here to grab coffee and breakfast. The egg sandwich I got on a bagel was HUGE and tasty, but it was pretty greasy. The coffee is really good and the service is fast and friendly. I recommend it!","useful":1,"user_id":"Ux0QheGWOT5bchLngmdFuQ"}
{"business_id":"WRQ-9LluyivReFiQZFUujw","cool":2,"date":"2012-05-28 22:06:05","funny":1,"review_id":"CxrS26JYuIRlPqZOM3uoQg","stars":5.0,"text":"Went to Vegas again Memorial Day Weekend but this time with my girlfriends so wanted them to try this place since LOVED it so much when I came with hubby.\n\nThis time tried the Angry Dog and just as amazingly deelish!!!\n\nFriends got Chili (homemade by Buldogis) Dog, Bulgogi Bowl, Fries, and again the Euro Fries with kimchee added and they LOVED it too!   My 2 friends who had the Chili Dog said the chili was very good! One of them is not even a hotdog fan and loved it :)\n\nIF you are EVER in Vegas THIS is a MUST!!!","useful":3,"user_id":"_Rwjy0YmGB4W0KUrfSUlOQ"}
{"business_id":"eSlmVbicgkhtD9niSuReJw","cool":0,"date":"2016-05-07 01:34:03","funny":0,"review_id":"EdLtoDFxxUiL-yaT3KNu4g","stars":4.0,"text":"Good environment, I ordered the famous meatloaf and it is large but a little bit salty. The waitress is not that friendly but overall I had a great experience.","useful":0,"user_id":"84TLoVQpU37Uih12qSH9OA"}
